qinikat/CW32-LowPowerBroadcastModule/Libraries/inc/cw32l083_gpio.h
/*******************************************************************************
*
* 代码许可和免责信息
* 武汉芯源半导体有限公司授予您使用所有编程代码示例的非专属的版权许可，您可以由此
* 生成根据您的特定需要而定制的相似功能。根据不能被排除的任何法定保证，武汉芯源半
* 导体有限公司及其程序开发商和供应商对程序或技术支持（如果有）不提供任何明示或暗
* 含的保证或条件，包括但不限于暗含的有关适销性、适用于某种特定用途和非侵权的保证
* 或条件。
* 无论何种情形，武汉芯源半导体有限公司及其程序开发商或供应商均不对下列各项负责，
* 即使被告知其发生的可能性时，也是如此：数据的丢失或损坏；直接的、特别的、附带的
* 或间接的损害，或任何后果性经济损害；或利润、业务、收入、商誉或预期可节省金额的
* 损失。
* 某些司法辖区不允许对直接的、附带的或后果性的损害有任何的排除或限制，因此某些或
* 全部上述排除或限制可能并不适用于您。
*
*******************************************************************************/
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __CW32L083_GPIO_H__
#define __CW32L083_GPIO_H__

#ifdef __cplusplus
extern "C"
{
#endif

/*****************************************************************************/
/* Include files                                                             */
/*****************************************************************************/

#include "base_types.h"
#include "cw32l083.h"

/*****************************************************************************/
/* Global pre-processor symbols/macros ('#define')                           */
/*****************************************************************************/

typedef struct
{
    uint32_t Pins;
    uint32_t Mode;
    uint32_t IT;
} GPIO_InitTypeDef;

typedef enum
{
    GPIO_Pin_RESET = 0,
    GPIO_Pin_SET
} GPIO_PinState;

//============================================================

void GPIO_SWD2GPIO(void);
void GPIO_GPIO2SWD(void);
void GPIO_LockPin(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pins);
void GPIO_DeInit(GPIO_TypeDef *GPIOx, uint32_t GPIO_Pins);
void GPIO_Init(GPIO_TypeDef *GPIOx, GPIO_InitTypeDef *GPIO_Init);
void GPIO_ConfigFilter(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pins, uint32_t FltClk);
void GPIO_WritePin(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pins, GPIO_PinState PinState);
void GPIO_Write(GPIO_TypeDef* GPIOx, uint16_t Value);
void GPIO_TogglePin(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pins);
GPIO_PinState GPIO_ReadPin(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin);
void GPIO_ResetBits(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pins);
void GPIO_SetBits(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pins);    
//============================================================

#define GPIO_MODE_ANALOG                    (0X00)
#define GPIO_MODE_INPUT                     (0x10)
#define GPIO_MODE_INPUT_PULLUP              (0x11)
#define GPIO_MODE_INPUT_PULLDOWN            (0x12)
#define GPIO_MODE_OUTPUT_PP                 (0x20)
#define GPIO_MODE_OUTPUT_OD                 (0x21)

#define GPIO_IT_NONE                        (0x80)
#define GPIO_IT_RISING                      (0x81)
#define GPIO_IT_FALLING                     (0x82)
#define GPIO_IT_HIGH                        (0x84)
#define GPIO_IT_LOW                         (0x88)

//============================================================

#define GPIO_PIN_0                          ((uint16_t)0x0001)   /* Pin 0    selected    */
#define GPIO_PIN_1                          ((uint16_t)0x0002)   /* Pin 1    selected    */
#define GPIO_PIN_2                          ((uint16_t)0x0004)   /* Pin 2    selected    */
#define GPIO_PIN_3                          ((uint16_t)0x0008)   /* Pin 3    selected    */
#define GPIO_PIN_4                          ((uint16_t)0x0010)   /* Pin 4    selected    */
#define GPIO_PIN_5                          ((uint16_t)0x0020)   /* Pin 5    selected    */
#define GPIO_PIN_6                          ((uint16_t)0x0040)   /* Pin 6    selected    */
#define GPIO_PIN_7                          ((uint16_t)0x0080)   /* Pin 7    selected    */
#define GPIO_PIN_8                          ((uint16_t)0x0100)   /* Pin 8    selected    */
#define GPIO_PIN_9                          ((uint16_t)0x0200)   /* Pin 9    selected    */
#define GPIO_PIN_10                         ((uint16_t)0x0400)   /* Pin 10   selected    */
#define GPIO_PIN_11                         ((uint16_t)0x0800)   /* Pin 11   selected    */
#define GPIO_PIN_12                         ((uint16_t)0x1000)   /* Pin 12   selected    */
#define GPIO_PIN_13                         ((uint16_t)0x2000)   /* Pin 13   selected    */
#define GPIO_PIN_14                         ((uint16_t)0x4000)   /* Pin 14   selected    */
#define GPIO_PIN_15                         ((uint16_t)0x8000)   /* Pin 15   selected    */
#define GPIO_PIN_All                        ((uint16_t)0xFFFF)   /* All pins selected    */

//============================================================
//端口滤波定义
#define GPIO_FLTCLK_HCLK2                   (((uint32_t)0) << 16)
#define GPIO_FLTCLK_HCLK4                   (((uint32_t)1) << 16)
#define GPIO_FLTCLK_HCLK8                   (((uint32_t)2) << 16)
#define GPIO_FLTCLK_BTIM1OV                 (((uint32_t)3) << 16)
#define GPIO_FLTCLK_RC150K                  (((uint32_t)4) << 16)
#define GPIO_FLTCLK_LSI                     (((uint32_t)5) << 16)
#define GPIO_FLTCLK_RC10K                   (((uint32_t)6) << 16)
#define GPIO_FLTCLK_LPTIMPWM                (((uint32_t)7) << 16)

//============================================================
//清除CW_GPIO中断标志
#define GPIOA_INTFLAG_CLR(Mask)             ((CW_GPIOA->ICR) = (~((uint32_t)(Mask))))
#define GPIOB_INTFLAG_CLR(Mask)             ((CW_GPIOB->ICR) = (~((uint32_t)(Mask))))
#define GPIOC_INTFLAG_CLR(Mask)             ((CW_GPIOC->ICR) = (~((uint32_t)(Mask))))
#define GPIOD_INTFLAG_CLR(Mask)             ((CW_GPIOD->ICR) = (~((uint32_t)(Mask))))
#define GPIOE_INTFLAG_CLR(Mask)             ((CW_GPIOE->ICR) = (~((uint32_t)(Mask))))
#define GPIOF_INTFLAG_CLR(Mask)             ((CW_GPIOF->ICR) = (~((uint32_t)(Mask))))

//============================================================
//ANALOG OR DIGTAL
#define PA00_DIGTAL_ENABLE()                (CW_GPIOA->ANALOG_f.PIN0  = 0)
#define PA00_ANALOG_ENABLE()                (CW_GPIOA->ANALOG_f.PIN0  = 1)
#define PA01_DIGTAL_ENABLE()                (CW_GPIOA->ANALOG_f.PIN1  = 0)
#define PA01_ANALOG_ENABLE()                (CW_GPIOA->ANALOG_f.PIN1  = 1)
#define PA02_DIGTAL_ENABLE()                (CW_GPIOA->ANALOG_f.PIN2  = 0)
#define PA02_ANALOG_ENABLE()                (CW_GPIOA->ANALOG_f.PIN2  = 1)
#define PA03_DIGTAL_ENABLE()                (CW_GPIOA->ANALOG_f.PIN3  = 0)
#define PA03_ANALOG_ENABLE()                (CW_GPIOA->ANALOG_f.PIN3  = 1)
#define PA04_DIGTAL_ENABLE()                (CW_GPIOA->ANALOG_f.PIN4  = 0)
#define PA04_ANALOG_ENABLE()                (CW_GPIOA->ANALOG_f.PIN4  = 1)
#define PA05_DIGTAL_ENABLE()                (CW_GPIOA->ANALOG_f.PIN5  = 0)
#define PA05_ANALOG_ENABLE()                (CW_GPIOA->ANALOG_f.PIN5  = 1)
#define PA06_DIGTAL_ENABLE()                (CW_GPIOA->ANALOG_f.PIN6  = 0)
#define PA06_ANALOG_ENABLE()                (CW_GPIOA->ANALOG_f.PIN6  = 1)
#define PA07_DIGTAL_ENABLE()                (CW_GPIOA->ANALOG_f.PIN7  = 0)
#define PA07_ANALOG_ENABLE()                (CW_GPIOA->ANALOG_f.PIN7  = 1)
#define PA08_DIGTAL_ENABLE()                (CW_GPIOA->ANALOG_f.PIN8  = 0)
#define PA08_ANALOG_ENABLE()                (CW_GPIOA->ANALOG_f.PIN8  = 1)
#define PA09_DIGTAL_ENABLE()                (CW_GPIOA->ANALOG_f.PIN9  = 0)
#define PA09_ANALOG_ENABLE()                (CW_GPIOA->ANALOG_f.PIN9  = 1)
#define PA10_DIGTAL_ENABLE()                (CW_GPIOA->ANALOG_f.PIN10 = 0)
#define PA10_ANALOG_ENABLE()                (CW_GPIOA->ANALOG_f.PIN10 = 1)
#define PA11_DIGTAL_ENABLE()                (CW_GPIOA->ANALOG_f.PIN11 = 0)
#define PA11_ANALOG_ENABLE()                (CW_GPIOA->ANALOG_f.PIN11 = 1)
#define PA12_DIGTAL_ENABLE()                (CW_GPIOA->ANALOG_f.PIN12 = 0)
#define PA12_ANALOG_ENABLE()                (CW_GPIOA->ANALOG_f.PIN12 = 1)
#define PA13_DIGTAL_ENABLE()                (CW_GPIOA->ANALOG_f.PIN13 = 0)
#define PA13_ANALOG_ENABLE()                (CW_GPIOA->ANALOG_f.PIN13 = 1)
#define PA14_DIGTAL_ENABLE()                (CW_GPIOA->ANALOG_f.PIN14 = 0)
#define PA14_ANALOG_ENABLE()                (CW_GPIOA->ANALOG_f.PIN14 = 1)
#define PA15_DIGTAL_ENABLE()                (CW_GPIOA->ANALOG_f.PIN15 = 0)
#define PA15_ANALOG_ENABLE()                (CW_GPIOA->ANALOG_f.PIN15 = 1)

#define PB00_DIGTAL_ENABLE()                (CW_GPIOB->ANALOG_f.PIN0  = 0)
#define PB00_ANALOG_ENABLE()                (CW_GPIOB->ANALOG_f.PIN0  = 1)
#define PB01_DIGTAL_ENABLE()                (CW_GPIOB->ANALOG_f.PIN1  = 0)
#define PB01_ANALOG_ENABLE()                (CW_GPIOB->ANALOG_f.PIN1  = 1)
#define PB02_DIGTAL_ENABLE()                (CW_GPIOB->ANALOG_f.PIN2  = 0)
#define PB02_ANALOG_ENABLE()                (CW_GPIOB->ANALOG_f.PIN2  = 1)
#define PB03_DIGTAL_ENABLE()                (CW_GPIOB->ANALOG_f.PIN3  = 0)
#define PB03_ANALOG_ENABLE()                (CW_GPIOB->ANALOG_f.PIN3  = 1)
#define PB04_DIGTAL_ENABLE()                (CW_GPIOB->ANALOG_f.PIN4  = 0)
#define PB04_ANALOG_ENABLE()                (CW_GPIOB->ANALOG_f.PIN4  = 1)
#define PB05_DIGTAL_ENABLE()                (CW_GPIOB->ANALOG_f.PIN5  = 0)
#define PB05_ANALOG_ENABLE()                (CW_GPIOB->ANALOG_f.PIN5  = 1)
#define PB06_DIGTAL_ENABLE()                (CW_GPIOB->ANALOG_f.PIN6  = 0)
#define PB06_ANALOG_ENABLE()                (CW_GPIOB->ANALOG_f.PIN6  = 1)
#define PB07_DIGTAL_ENABLE()                (CW_GPIOB->ANALOG_f.PIN7  = 0)
#define PB07_ANALOG_ENABLE()                (CW_GPIOB->ANALOG_f.PIN7  = 1)
#define PB08_DIGTAL_ENABLE()                (CW_GPIOB->ANALOG_f.PIN8  = 0)
#define PB08_ANALOG_ENABLE()                (CW_GPIOB->ANALOG_f.PIN8  = 1)
#define PB09_DIGTAL_ENABLE()                (CW_GPIOB->ANALOG_f.PIN9  = 0)
#define PB09_ANALOG_ENABLE()                (CW_GPIOB->ANALOG_f.PIN9  = 1)
#define PB10_DIGTAL_ENABLE()                (CW_GPIOB->ANALOG_f.PIN10 = 0)
#define PB10_ANALOG_ENABLE()                (CW_GPIOB->ANALOG_f.PIN10 = 1)
#define PB11_DIGTAL_ENABLE()                (CW_GPIOB->ANALOG_f.PIN11 = 0)
#define PB11_ANALOG_ENABLE()                (CW_GPIOB->ANALOG_f.PIN11 = 1)
#define PB12_DIGTAL_ENABLE()                (CW_GPIOB->ANALOG_f.PIN12 = 0)
#define PB12_ANALOG_ENABLE()                (CW_GPIOB->ANALOG_f.PIN12 = 1)
#define PB13_DIGTAL_ENABLE()                (CW_GPIOB->ANALOG_f.PIN13 = 0)
#define PB13_ANALOG_ENABLE()                (CW_GPIOB->ANALOG_f.PIN13 = 1)
#define PB14_DIGTAL_ENABLE()                (CW_GPIOB->ANALOG_f.PIN14 = 0)
#define PB14_ANALOG_ENABLE()                (CW_GPIOB->ANALOG_f.PIN14 = 1)
#define PB15_DIGTAL_ENABLE()                (CW_GPIOB->ANALOG_f.PIN15 = 0)
#define PB15_ANALOG_ENABLE()                (CW_GPIOB->ANALOG_f.PIN15 = 1)

#define PC00_DIGTAL_ENABLE()                (CW_GPIOC->ANALOG_f.PIN0  = 0)
#define PC00_ANALOG_ENABLE()                (CW_GPIOC->ANALOG_f.PIN0  = 1)
#define PC01_DIGTAL_ENABLE()                (CW_GPIOC->ANALOG_f.PIN1  = 0)
#define PC01_ANALOG_ENABLE()                (CW_GPIOC->ANALOG_f.PIN1  = 1)
#define PC02_DIGTAL_ENABLE()                (CW_GPIOC->ANALOG_f.PIN2  = 0)
#define PC02_ANALOG_ENABLE()                (CW_GPIOC->ANALOG_f.PIN2  = 1)
#define PC03_DIGTAL_ENABLE()                (CW_GPIOC->ANALOG_f.PIN3  = 0)
#define PC03_ANALOG_ENABLE()                (CW_GPIOC->ANALOG_f.PIN3  = 1)
#define PC04_DIGTAL_ENABLE()                (CW_GPIOC->ANALOG_f.PIN4  = 0)
#define PC04_ANALOG_ENABLE()                (CW_GPIOC->ANALOG_f.PIN4  = 1)
#define PC05_DIGTAL_ENABLE()                (CW_GPIOC->ANALOG_f.PIN5  = 0)
#define PC05_ANALOG_ENABLE()                (CW_GPIOC->ANALOG_f.PIN5  = 1)
#define PC06_DIGTAL_ENABLE()                (CW_GPIOC->ANALOG_f.PIN6  = 0)
#define PC06_ANALOG_ENABLE()                (CW_GPIOC->ANALOG_f.PIN6  = 1)
#define PC07_DIGTAL_ENABLE()                (CW_GPIOC->ANALOG_f.PIN7  = 0)
#define PC07_ANALOG_ENABLE()                (CW_GPIOC->ANALOG_f.PIN7  = 1)
#define PC08_DIGTAL_ENABLE()                (CW_GPIOC->ANALOG_f.PIN8  = 0)
#define PC08_ANALOG_ENABLE()                (CW_GPIOC->ANALOG_f.PIN8  = 1)
#define PC09_DIGTAL_ENABLE()                (CW_GPIOC->ANALOG_f.PIN9  = 0)
#define PC09_ANALOG_ENABLE()                (CW_GPIOC->ANALOG_f.PIN9  = 1)
#define PC10_DIGTAL_ENABLE()                (CW_GPIOC->ANALOG_f.PIN10 = 0)
#define PC10_ANALOG_ENABLE()                (CW_GPIOC->ANALOG_f.PIN10 = 1)
#define PC11_DIGTAL_ENABLE()                (CW_GPIOC->ANALOG_f.PIN11 = 0)
#define PC11_ANALOG_ENABLE()                (CW_GPIOC->ANALOG_f.PIN11 = 1)
#define PC12_DIGTAL_ENABLE()                (CW_GPIOC->ANALOG_f.PIN12 = 0)
#define PC12_ANALOG_ENABLE()                (CW_GPIOC->ANALOG_f.PIN12 = 1)
#define PC13_DIGTAL_ENABLE()                (CW_GPIOC->ANALOG_f.PIN13 = 0)
#define PC13_ANALOG_ENABLE()                (CW_GPIOC->ANALOG_f.PIN13 = 1)
#define PC14_DIGTAL_ENABLE()                (CW_GPIOC->ANALOG_f.PIN14 = 0)
#define PC14_ANALOG_ENABLE()                (CW_GPIOC->ANALOG_f.PIN14 = 1)
#define PC15_DIGTAL_ENABLE()                (CW_GPIOC->ANALOG_f.PIN15 = 0)
#define PC15_ANALOG_ENABLE()                (CW_GPIOC->ANALOG_f.PIN15 = 1)

#define PD00_DIGTAL_ENABLE()                (CW_GPIOD->ANALOG_f.PIN0  = 0)
#define PD00_ANALOG_ENABLE()                (CW_GPIOD->ANALOG_f.PIN0  = 1)
#define PD01_DIGTAL_ENABLE()                (CW_GPIOD->ANALOG_f.PIN1  = 0)
#define PD01_ANALOG_ENABLE()                (CW_GPIOD->ANALOG_f.PIN1  = 1)
#define PD02_DIGTAL_ENABLE()                (CW_GPIOD->ANALOG_f.PIN2  = 0)
#define PD02_ANALOG_ENABLE()                (CW_GPIOD->ANALOG_f.PIN2  = 1)
#define PD03_DIGTAL_ENABLE()                (CW_GPIOD->ANALOG_f.PIN3  = 0)
#define PD03_ANALOG_ENABLE()                (CW_GPIOD->ANALOG_f.PIN3  = 1)
#define PD04_DIGTAL_ENABLE()                (CW_GPIOD->ANALOG_f.PIN4  = 0)
#define PD04_ANALOG_ENABLE()                (CW_GPIOD->ANALOG_f.PIN4  = 1)
#define PD05_DIGTAL_ENABLE()                (CW_GPIOD->ANALOG_f.PIN5  = 0)
#define PD05_ANALOG_ENABLE()                (CW_GPIOD->ANALOG_f.PIN5  = 1)
#define PD06_DIGTAL_ENABLE()                (CW_GPIOD->ANALOG_f.PIN6  = 0)
#define PD06_ANALOG_ENABLE()                (CW_GPIOD->ANALOG_f.PIN6  = 1)
#define PD07_DIGTAL_ENABLE()                (CW_GPIOD->ANALOG_f.PIN7  = 0)
#define PD07_ANALOG_ENABLE()                (CW_GPIOD->ANALOG_f.PIN7  = 1)
#define PD08_DIGTAL_ENABLE()                (CW_GPIOD->ANALOG_f.PIN8  = 0)
#define PD08_ANALOG_ENABLE()                (CW_GPIOD->ANALOG_f.PIN8  = 1)
#define PD09_DIGTAL_ENABLE()                (CW_GPIOD->ANALOG_f.PIN9  = 0)
#define PD09_ANALOG_ENABLE()                (CW_GPIOD->ANALOG_f.PIN9  = 1)
#define PD10_DIGTAL_ENABLE()                (CW_GPIOD->ANALOG_f.PIN10 = 0)
#define PD10_ANALOG_ENABLE()                (CW_GPIOD->ANALOG_f.PIN10 = 1)
#define PD11_DIGTAL_ENABLE()                (CW_GPIOD->ANALOG_f.PIN11 = 0)
#define PD11_ANALOG_ENABLE()                (CW_GPIOD->ANALOG_f.PIN11 = 1)
#define PD12_DIGTAL_ENABLE()                (CW_GPIOD->ANALOG_f.PIN12 = 0)
#define PD12_ANALOG_ENABLE()                (CW_GPIOD->ANALOG_f.PIN12 = 1)
#define PD13_DIGTAL_ENABLE()                (CW_GPIOD->ANALOG_f.PIN13 = 0)
#define PD13_ANALOG_ENABLE()                (CW_GPIOD->ANALOG_f.PIN13 = 1)
#define PD14_DIGTAL_ENABLE()                (CW_GPIOD->ANALOG_f.PIN14 = 0)
#define PD14_ANALOG_ENABLE()                (CW_GPIOD->ANALOG_f.PIN14 = 1)
#define PD15_DIGTAL_ENABLE()                (CW_GPIOD->ANALOG_f.PIN15 = 0)
#define PD15_ANALOG_ENABLE()                (CW_GPIOD->ANALOG_f.PIN15 = 1)

#define PE00_DIGTAL_ENABLE()                (CW_GPIOE->ANALOG_f.PIN0  = 0)
#define PE00_ANALOG_ENABLE()                (CW_GPIOE->ANALOG_f.PIN0  = 1)
#define PE01_DIGTAL_ENABLE()                (CW_GPIOE->ANALOG_f.PIN1  = 0)
#define PE01_ANALOG_ENABLE()                (CW_GPIOE->ANALOG_f.PIN1  = 1)
#define PE02_DIGTAL_ENABLE()                (CW_GPIOE->ANALOG_f.PIN2  = 0)
#define PE02_ANALOG_ENABLE()                (CW_GPIOE->ANALOG_f.PIN2  = 1)
#define PE03_DIGTAL_ENABLE()                (CW_GPIOE->ANALOG_f.PIN3  = 0)
#define PE03_ANALOG_ENABLE()                (CW_GPIOE->ANALOG_f.PIN3  = 1)
#define PE04_DIGTAL_ENABLE()                (CW_GPIOE->ANALOG_f.PIN4  = 0)
#define PE04_ANALOG_ENABLE()                (CW_GPIOE->ANALOG_f.PIN4  = 1)
#define PE05_DIGTAL_ENABLE()                (CW_GPIOE->ANALOG_f.PIN5  = 0)
#define PE05_ANALOG_ENABLE()                (CW_GPIOE->ANALOG_f.PIN5  = 1)
#define PE06_DIGTAL_ENABLE()                (CW_GPIOE->ANALOG_f.PIN6  = 0)
#define PE06_ANALOG_ENABLE()                (CW_GPIOE->ANALOG_f.PIN6  = 1)
#define PE07_DIGTAL_ENABLE()                (CW_GPIOE->ANALOG_f.PIN7  = 0)
#define PE07_ANALOG_ENABLE()                (CW_GPIOE->ANALOG_f.PIN7  = 1)
#define PE08_DIGTAL_ENABLE()                (CW_GPIOE->ANALOG_f.PIN8  = 0)
#define PE08_ANALOG_ENABLE()                (CW_GPIOE->ANALOG_f.PIN8  = 1)
#define PE09_DIGTAL_ENABLE()                (CW_GPIOE->ANALOG_f.PIN9  = 0)
#define PE09_ANALOG_ENABLE()                (CW_GPIOE->ANALOG_f.PIN9  = 1)
#define PE10_DIGTAL_ENABLE()                (CW_GPIOE->ANALOG_f.PIN10 = 0)
#define PE10_ANALOG_ENABLE()                (CW_GPIOE->ANALOG_f.PIN10 = 1)
#define PE11_DIGTAL_ENABLE()                (CW_GPIOE->ANALOG_f.PIN11 = 0)
#define PE11_ANALOG_ENABLE()                (CW_GPIOE->ANALOG_f.PIN11 = 1)
#define PE12_DIGTAL_ENABLE()                (CW_GPIOE->ANALOG_f.PIN12 = 0)
#define PE12_ANALOG_ENABLE()                (CW_GPIOE->ANALOG_f.PIN12 = 1)
#define PE13_DIGTAL_ENABLE()                (CW_GPIOE->ANALOG_f.PIN13 = 0)
#define PE13_ANALOG_ENABLE()                (CW_GPIOE->ANALOG_f.PIN13 = 1)
#define PE14_DIGTAL_ENABLE()                (CW_GPIOE->ANALOG_f.PIN14 = 0)
#define PE14_ANALOG_ENABLE()                (CW_GPIOE->ANALOG_f.PIN14 = 1)
#define PE15_DIGTAL_ENABLE()                (CW_GPIOE->ANALOG_f.PIN15 = 0)
#define PE15_ANALOG_ENABLE()                (CW_GPIOE->ANALOG_f.PIN15 = 1)

#define PF00_DIGTAL_ENABLE()                (CW_GPIOF->ANALOG_f.PIN0  = 0)
#define PF00_ANALOG_ENABLE()                (CW_GPIOF->ANALOG_f.PIN0  = 1)
#define PF01_DIGTAL_ENABLE()                (CW_GPIOF->ANALOG_f.PIN1  = 0)
#define PF01_ANALOG_ENABLE()                (CW_GPIOF->ANALOG_f.PIN1  = 1)
#define PF02_DIGTAL_ENABLE()                (CW_GPIOF->ANALOG_f.PIN2  = 0)
#define PF02_ANALOG_ENABLE()                (CW_GPIOF->ANALOG_f.PIN2  = 1)
#define PF03_DIGTAL_ENABLE()                (CW_GPIOF->ANALOG_f.PIN3  = 0)
#define PF03_ANALOG_ENABLE()                (CW_GPIOF->ANALOG_f.PIN3  = 1)
#define PF04_DIGTAL_ENABLE()                (CW_GPIOF->ANALOG_f.PIN4  = 0)
#define PF04_ANALOG_ENABLE()                (CW_GPIOF->ANALOG_f.PIN4  = 1)
#define PF05_DIGTAL_ENABLE()                (CW_GPIOF->ANALOG_f.PIN5  = 0)
#define PF05_ANALOG_ENABLE()                (CW_GPIOF->ANALOG_f.PIN5  = 1)
#define PF06_DIGTAL_ENABLE()                (CW_GPIOF->ANALOG_f.PIN6  = 0)
#define PF06_ANALOG_ENABLE()                (CW_GPIOF->ANALOG_f.PIN6  = 1)
#define PF07_DIGTAL_ENABLE()                (CW_GPIOF->ANALOG_f.PIN7  = 0)
#define PF07_ANALOG_ENABLE()                (CW_GPIOF->ANALOG_f.PIN7  = 1)
#define PF08_DIGTAL_ENABLE()                (CW_GPIOF->ANALOG_f.PIN8  = 0)
#define PF08_ANALOG_ENABLE()                (CW_GPIOF->ANALOG_f.PIN8  = 1)
#define PF09_DIGTAL_ENABLE()                (CW_GPIOF->ANALOG_f.PIN9  = 0)
#define PF09_ANALOG_ENABLE()                (CW_GPIOF->ANALOG_f.PIN9  = 1)
#define PF10_DIGTAL_ENABLE()                (CW_GPIOF->ANALOG_f.PIN10 = 0)
#define PF10_ANALOG_ENABLE()                (CW_GPIOF->ANALOG_f.PIN10 = 1)

//============================================================
// INPUTAND OUTPUT
#define PA00_DIR_OUTPUT()                   (CW_GPIOA->DIR_f.PIN0  = 0)
#define PA00_DIR_INPUT()                    (CW_GPIOA->DIR_f.PIN0  = 1)
#define PA01_DIR_OUTPUT()                   (CW_GPIOA->DIR_f.PIN1  = 0)
#define PA01_DIR_INPUT()                    (CW_GPIOA->DIR_f.PIN1  = 1)
#define PA02_DIR_OUTPUT()                   (CW_GPIOA->DIR_f.PIN2  = 0)
#define PA02_DIR_INPUT()                    (CW_GPIOA->DIR_f.PIN2  = 1)
#define PA03_DIR_OUTPUT()                   (CW_GPIOA->DIR_f.PIN3  = 0)
#define PA03_DIR_INPUT()                    (CW_GPIOA->DIR_f.PIN3  = 1)
#define PA04_DIR_OUTPUT()                   (CW_GPIOA->DIR_f.PIN4  = 0)
#define PA04_DIR_INPUT()                    (CW_GPIOA->DIR_f.PIN4  = 1)
#define PA05_DIR_OUTPUT()                   (CW_GPIOA->DIR_f.PIN5  = 0)
#define PA05_DIR_INPUT()                    (CW_GPIOA->DIR_f.PIN5  = 1)
#define PA06_DIR_OUTPUT()                   (CW_GPIOA->DIR_f.PIN6  = 0)
#define PA06_DIR_INPUT()                    (CW_GPIOA->DIR_f.PIN6  = 1)
#define PA07_DIR_OUTPUT()                   (CW_GPIOA->DIR_f.PIN7  = 0)
#define PA07_DIR_INPUT()                    (CW_GPIOA->DIR_f.PIN7  = 1)
#define PA08_DIR_OUTPUT()                   (CW_GPIOA->DIR_f.PIN8  = 0)
#define PA08_DIR_INPUT()                    (CW_GPIOA->DIR_f.PIN8  = 1)
#define PA09_DIR_OUTPUT()                   (CW_GPIOA->DIR_f.PIN9  = 0)
#define PA09_DIR_INPUT()                    (CW_GPIOA->DIR_f.PIN9  = 1)
#define PA10_DIR_OUTPUT()                   (CW_GPIOA->DIR_f.PIN10 = 0)
#define PA10_DIR_INPUT()                    (CW_GPIOA->DIR_f.PIN10 = 1)
#define PA11_DIR_OUTPUT()                   (CW_GPIOA->DIR_f.PIN11 = 0)
#define PA11_DIR_INPUT()                    (CW_GPIOA->DIR_f.PIN11 = 1)
#define PA12_DIR_OUTPUT()                   (CW_GPIOA->DIR_f.PIN12 = 0)
#define PA12_DIR_INPUT()                    (CW_GPIOA->DIR_f.PIN12 = 1)
#define PA13_DIR_OUTPUT()                   (CW_GPIOA->DIR_f.PIN13 = 0)
#define PA13_DIR_INPUT()                    (CW_GPIOA->DIR_f.PIN13 = 1)
#define PA14_DIR_OUTPUT()                   (CW_GPIOA->DIR_f.PIN14 = 0)
#define PA14_DIR_INPUT()                    (CW_GPIOA->DIR_f.PIN14 = 1)
#define PA15_DIR_OUTPUT()                   (CW_GPIOA->DIR_f.PIN15 = 0)
#define PA15_DIR_INPUT()                    (CW_GPIOA->DIR_f.PIN15 = 1)

