qinikat/CW32-LowPowerBroadcastModule/Libraries/inc/cw32l083_gpio.h
#define PB00_DIR_OUTPUT()                   (CW_GPIOB->DIR_f.PIN0  = 0)
#define PB00_DIR_INPUT()                    (CW_GPIOB->DIR_f.PIN0  = 1)
#define PB01_DIR_OUTPUT()                   (CW_GPIOB->DIR_f.PIN1  = 0)
#define PB01_DIR_INPUT()                    (CW_GPIOB->DIR_f.PIN1  = 1)
#define PB02_DIR_OUTPUT()                   (CW_GPIOB->DIR_f.PIN2  = 0)
#define PB02_DIR_INPUT()                    (CW_GPIOB->DIR_f.PIN2  = 1)
#define PB03_DIR_OUTPUT()                   (CW_GPIOB->DIR_f.PIN3  = 0)
#define PB03_DIR_INPUT()                    (CW_GPIOB->DIR_f.PIN3  = 1)
#define PB04_DIR_OUTPUT()                   (CW_GPIOB->DIR_f.PIN4  = 0)
#define PB04_DIR_INPUT()                    (CW_GPIOB->DIR_f.PIN4  = 1)
#define PB05_DIR_OUTPUT()                   (CW_GPIOB->DIR_f.PIN5  = 0)
#define PB05_DIR_INPUT()                    (CW_GPIOB->DIR_f.PIN5  = 1)
#define PB06_DIR_OUTPUT()                   (CW_GPIOB->DIR_f.PIN6  = 0)
#define PB06_DIR_INPUT()                    (CW_GPIOB->DIR_f.PIN6  = 1)
#define PB07_DIR_OUTPUT()                   (CW_GPIOB->DIR_f.PIN7  = 0)
#define PB07_DIR_INPUT()                    (CW_GPIOB->DIR_f.PIN7  = 1)
#define PB08_DIR_OUTPUT()                   (CW_GPIOB->DIR_f.PIN8  = 0)
#define PB08_DIR_INPUT()                    (CW_GPIOB->DIR_f.PIN8  = 1)
#define PB09_DIR_OUTPUT()                   (CW_GPIOB->DIR_f.PIN9  = 0)
#define PB09_DIR_INPUT()                    (CW_GPIOB->DIR_f.PIN9  = 1)
#define PB10_DIR_OUTPUT()                   (CW_GPIOB->DIR_f.PIN10 = 0)
#define PB10_DIR_INPUT()                    (CW_GPIOB->DIR_f.PIN10 = 1)
#define PB11_DIR_OUTPUT()                   (CW_GPIOB->DIR_f.PIN11 = 0)
#define PB11_DIR_INPUT()                    (CW_GPIOB->DIR_f.PIN11 = 1)
#define PB12_DIR_OUTPUT()                   (CW_GPIOB->DIR_f.PIN12 = 0)
#define PB12_DIR_INPUT()                    (CW_GPIOB->DIR_f.PIN12 = 1)
#define PB13_DIR_OUTPUT()                   (CW_GPIOB->DIR_f.PIN13 = 0)
#define PB13_DIR_INPUT()                    (CW_GPIOB->DIR_f.PIN13 = 1)
#define PB14_DIR_OUTPUT()                   (CW_GPIOB->DIR_f.PIN14 = 0)
#define PB14_DIR_INPUT()                    (CW_GPIOB->DIR_f.PIN14 = 1)
#define PB15_DIR_OUTPUT()                   (CW_GPIOB->DIR_f.PIN15 = 0)
#define PB15_DIR_INPUT()                    (CW_GPIOB->DIR_f.PIN15 = 1)

#define PC00_DIR_OUTPUT()                   (CW_GPIOC->DIR_f.PIN0  = 0)
#define PC00_DIR_INPUT()                    (CW_GPIOC->DIR_f.PIN0  = 1)
#define PC01_DIR_OUTPUT()                   (CW_GPIOC->DIR_f.PIN1  = 0)
#define PC01_DIR_INPUT()                    (CW_GPIOC->DIR_f.PIN1  = 1)
#define PC02_DIR_OUTPUT()                   (CW_GPIOC->DIR_f.PIN2  = 0)
#define PC02_DIR_INPUT()                    (CW_GPIOC->DIR_f.PIN2  = 1)
#define PC03_DIR_OUTPUT()                   (CW_GPIOC->DIR_f.PIN3  = 0)
#define PC03_DIR_INPUT()                    (CW_GPIOC->DIR_f.PIN3  = 1)
#define PC04_DIR_OUTPUT()                   (CW_GPIOC->DIR_f.PIN4  = 0)
#define PC04_DIR_INPUT()                    (CW_GPIOC->DIR_f.PIN4  = 1)
#define PC05_DIR_OUTPUT()                   (CW_GPIOC->DIR_f.PIN5  = 0)
#define PC05_DIR_INPUT()                    (CW_GPIOC->DIR_f.PIN5  = 1)
#define PC06_DIR_OUTPUT()                   (CW_GPIOC->DIR_f.PIN6  = 0)
#define PC06_DIR_INPUT()                    (CW_GPIOC->DIR_f.PIN6  = 1)
#define PC07_DIR_OUTPUT()                   (CW_GPIOC->DIR_f.PIN7  = 0)
#define PC07_DIR_INPUT()                    (CW_GPIOC->DIR_f.PIN7  = 1)
#define PC08_DIR_OUTPUT()                   (CW_GPIOC->DIR_f.PIN8  = 0)
#define PC08_DIR_INPUT()                    (CW_GPIOC->DIR_f.PIN8  = 1)
#define PC09_DIR_OUTPUT()                   (CW_GPIOC->DIR_f.PIN9  = 0)
#define PC09_DIR_INPUT()                    (CW_GPIOC->DIR_f.PIN9  = 1)
#define PC10_DIR_OUTPUT()                   (CW_GPIOC->DIR_f.PIN10 = 0)
#define PC10_DIR_INPUT()                    (CW_GPIOC->DIR_f.PIN10 = 1)
#define PC11_DIR_OUTPUT()                   (CW_GPIOC->DIR_f.PIN11 = 0)
#define PC11_DIR_INPUT()                    (CW_GPIOC->DIR_f.PIN11 = 1)
#define PC12_DIR_OUTPUT()                   (CW_GPIOC->DIR_f.PIN12 = 0)
#define PC12_DIR_INPUT()                    (CW_GPIOC->DIR_f.PIN12 = 1)
#define PC13_DIR_OUTPUT()                   (CW_GPIOC->DIR_f.PIN13 = 0)
#define PC13_DIR_INPUT()                    (CW_GPIOC->DIR_f.PIN13 = 1)
#define PC14_DIR_OUTPUT()                   (CW_GPIOC->DIR_f.PIN14 = 0)
#define PC14_DIR_INPUT()                    (CW_GPIOC->DIR_f.PIN14 = 1)
#define PC15_DIR_OUTPUT()                   (CW_GPIOC->DIR_f.PIN15 = 0)
#define PC15_DIR_INPUT()                    (CW_GPIOC->DIR_f.PIN15 = 1)

#define PD00_DIR_OUTPUT()                   (CW_GPIOD->DIR_f.PIN0  = 0)
#define PD00_DIR_INPUT()                    (CW_GPIOD->DIR_f.PIN0  = 1)
#define PD01_DIR_OUTPUT()                   (CW_GPIOD->DIR_f.PIN1  = 0)
#define PD01_DIR_INPUT()                    (CW_GPIOD->DIR_f.PIN1  = 1)
#define PD02_DIR_OUTPUT()                   (CW_GPIOD->DIR_f.PIN2  = 0)
#define PD02_DIR_INPUT()                    (CW_GPIOD->DIR_f.PIN2  = 1)
#define PD03_DIR_OUTPUT()                   (CW_GPIOD->DIR_f.PIN3  = 0)
#define PD03_DIR_INPUT()                    (CW_GPIOD->DIR_f.PIN3  = 1)
#define PD04_DIR_OUTPUT()                   (CW_GPIOD->DIR_f.PIN4  = 0)
#define PD04_DIR_INPUT()                    (CW_GPIOD->DIR_f.PIN4  = 1)
#define PD05_DIR_OUTPUT()                   (CW_GPIOD->DIR_f.PIN5  = 0)
#define PD05_DIR_INPUT()                    (CW_GPIOD->DIR_f.PIN5  = 1)
#define PD06_DIR_OUTPUT()                   (CW_GPIOD->DIR_f.PIN6  = 0)
#define PD06_DIR_INPUT()                    (CW_GPIOD->DIR_f.PIN6  = 1)
#define PD07_DIR_OUTPUT()                   (CW_GPIOD->DIR_f.PIN7  = 0)
#define PD07_DIR_INPUT()                    (CW_GPIOD->DIR_f.PIN7  = 1)
#define PD08_DIR_OUTPUT()                   (CW_GPIOD->DIR_f.PIN8  = 0)
#define PD08_DIR_INPUT()                    (CW_GPIOD->DIR_f.PIN8  = 1)
#define PD09_DIR_OUTPUT()                   (CW_GPIOD->DIR_f.PIN9  = 0)
#define PD09_DIR_INPUT()                    (CW_GPIOD->DIR_f.PIN9  = 1)
#define PD10_DIR_OUTPUT()                   (CW_GPIOD->DIR_f.PIN10 = 0)
#define PD10_DIR_INPUT()                    (CW_GPIOD->DIR_f.PIN10 = 1)
#define PD11_DIR_OUTPUT()                   (CW_GPIOD->DIR_f.PIN11 = 0)
#define PD11_DIR_INPUT()                    (CW_GPIOD->DIR_f.PIN11 = 1)
#define PD12_DIR_OUTPUT()                   (CW_GPIOD->DIR_f.PIN12 = 0)
#define PD12_DIR_INPUT()                    (CW_GPIOD->DIR_f.PIN12 = 1)
#define PD13_DIR_OUTPUT()                   (CW_GPIOD->DIR_f.PIN13 = 0)
#define PD13_DIR_INPUT()                    (CW_GPIOD->DIR_f.PIN13 = 1)
#define PD14_DIR_OUTPUT()                   (CW_GPIOD->DIR_f.PIN14 = 0)
#define PD14_DIR_INPUT()                    (CW_GPIOD->DIR_f.PIN14 = 1)
#define PD15_DIR_OUTPUT()                   (CW_GPIOD->DIR_f.PIN15 = 0)
#define PD15_DIR_INPUT()                    (CW_GPIOD->DIR_f.PIN15 = 1)

#define PE00_DIR_OUTPUT()                   (CW_GPIOE->DIR_f.PIN0  = 0)
#define PE00_DIR_INPUT()                    (CW_GPIOE->DIR_f.PIN0  = 1)
#define PE01_DIR_OUTPUT()                   (CW_GPIOE->DIR_f.PIN1  = 0)
#define PE01_DIR_INPUT()                    (CW_GPIOE->DIR_f.PIN1  = 1)
#define PE02_DIR_OUTPUT()                   (CW_GPIOE->DIR_f.PIN2  = 0)
#define PE02_DIR_INPUT()                    (CW_GPIOE->DIR_f.PIN2  = 1)
#define PE03_DIR_OUTPUT()                   (CW_GPIOE->DIR_f.PIN3  = 0)
#define PE03_DIR_INPUT()                    (CW_GPIOE->DIR_f.PIN3  = 1)
#define PE04_DIR_OUTPUT()                   (CW_GPIOE->DIR_f.PIN4  = 0)
#define PE04_DIR_INPUT()                    (CW_GPIOE->DIR_f.PIN4  = 1)
#define PE05_DIR_OUTPUT()                   (CW_GPIOE->DIR_f.PIN5  = 0)
#define PE05_DIR_INPUT()                    (CW_GPIOE->DIR_f.PIN5  = 1)
#define PE06_DIR_OUTPUT()                   (CW_GPIOE->DIR_f.PIN6  = 0)
#define PE06_DIR_INPUT()                    (CW_GPIOE->DIR_f.PIN6  = 1)
#define PE07_DIR_OUTPUT()                   (CW_GPIOE->DIR_f.PIN7  = 0)
#define PE07_DIR_INPUT()                    (CW_GPIOE->DIR_f.PIN7  = 1)
#define PE08_DIR_OUTPUT()                   (CW_GPIOE->DIR_f.PIN8  = 0)
#define PE08_DIR_INPUT()                    (CW_GPIOE->DIR_f.PIN8  = 1)
#define PE09_DIR_OUTPUT()                   (CW_GPIOE->DIR_f.PIN9  = 0)
#define PE09_DIR_INPUT()                    (CW_GPIOE->DIR_f.PIN9  = 1)
#define PE10_DIR_OUTPUT()                   (CW_GPIOE->DIR_f.PIN10 = 0)
#define PE10_DIR_INPUT()                    (CW_GPIOE->DIR_f.PIN10 = 1)
#define PE11_DIR_OUTPUT()                   (CW_GPIOE->DIR_f.PIN11 = 0)
#define PE11_DIR_INPUT()                    (CW_GPIOE->DIR_f.PIN11 = 1)
#define PE12_DIR_OUTPUT()                   (CW_GPIOE->DIR_f.PIN12 = 0)
#define PE12_DIR_INPUT()                    (CW_GPIOE->DIR_f.PIN12 = 1)
#define PE13_DIR_OUTPUT()                   (CW_GPIOE->DIR_f.PIN13 = 0)
#define PE13_DIR_INPUT()                    (CW_GPIOE->DIR_f.PIN13 = 1)
#define PE14_DIR_OUTPUT()                   (CW_GPIOE->DIR_f.PIN14 = 0)
#define PE14_DIR_INPUT()                    (CW_GPIOE->DIR_f.PIN14 = 1)
#define PE15_DIR_OUTPUT()                   (CW_GPIOE->DIR_f.PIN15 = 0)
#define PE15_DIR_INPUT()                    (CW_GPIOE->DIR_f.PIN15 = 1)

#define PF00_DIR_OUTPUT()                   (CW_GPIOF->DIR_f.PIN0  = 0)
#define PF00_DIR_INPUT()                    (CW_GPIOF->DIR_f.PIN0  = 1)
#define PF01_DIR_OUTPUT()                   (CW_GPIOF->DIR_f.PIN1  = 0)
#define PF01_DIR_INPUT()                    (CW_GPIOF->DIR_f.PIN1  = 1)
#define PF02_DIR_OUTPUT()                   (CW_GPIOF->DIR_f.PIN2  = 0)
#define PF02_DIR_INPUT()                    (CW_GPIOF->DIR_f.PIN2  = 1)
#define PF03_DIR_OUTPUT()                   (CW_GPIOF->DIR_f.PIN3  = 0)
#define PF03_DIR_INPUT()                    (CW_GPIOF->DIR_f.PIN3  = 1)
#define PF04_DIR_OUTPUT()                   (CW_GPIOF->DIR_f.PIN4  = 0)
#define PF04_DIR_INPUT()                    (CW_GPIOF->DIR_f.PIN4  = 1)
#define PF05_DIR_OUTPUT()                   (CW_GPIOF->DIR_f.PIN5  = 0)
#define PF05_DIR_INPUT()                    (CW_GPIOF->DIR_f.PIN5  = 1)
#define PF06_DIR_OUTPUT()                   (CW_GPIOF->DIR_f.PIN6  = 0)
#define PF06_DIR_INPUT()                    (CW_GPIOF->DIR_f.PIN6  = 1)
#define PF07_DIR_OUTPUT()                   (CW_GPIOF->DIR_f.PIN7  = 0)
#define PF07_DIR_INPUT()                    (CW_GPIOF->DIR_f.PIN7  = 1)
#define PF08_DIR_OUTPUT()                   (CW_GPIOF->DIR_f.PIN8  = 0)
#define PF08_DIR_INPUT()                    (CW_GPIOF->DIR_f.PIN8  = 1)
#define PF09_DIR_OUTPUT()                   (CW_GPIOF->DIR_f.PIN9  = 0)
#define PF09_DIR_INPUT()                    (CW_GPIOF->DIR_f.PIN9  = 1)
#define PF10_DIR_OUTPUT()                   (CW_GPIOF->DIR_f.PIN10 = 0)
#define PF10_DIR_INPUT()                    (CW_GPIOF->DIR_f.PIN10 = 1)

//============================================================
//push-pull or opendrain
#define PA00_PUSHPULL_ENABLE()              (CW_GPIOA->OPENDRAIN_f.PIN0  = 0)
#define PA00_OPENDRAIN_ENABLE()             (CW_GPIOA->OPENDRAIN_f.PIN0  = 1)
#define PA01_PUSHPULL_ENABLE()              (CW_GPIOA->OPENDRAIN_f.PIN1  = 0)
#define PA01_OPENDRAIN_ENABLE()             (CW_GPIOA->OPENDRAIN_f.PIN1  = 1)
#define PA02_PUSHPULL_ENABLE()              (CW_GPIOA->OPENDRAIN_f.PIN2  = 0)
#define PA02_OPENDRAIN_ENABLE()             (CW_GPIOA->OPENDRAIN_f.PIN2  = 1)
#define PA03_PUSHPULL_ENABLE()              (CW_GPIOA->OPENDRAIN_f.PIN3  = 0)
#define PA03_OPENDRAIN_ENABLE()             (CW_GPIOA->OPENDRAIN_f.PIN3  = 1)
#define PA04_PUSHPULL_ENABLE()              (CW_GPIOA->OPENDRAIN_f.PIN4  = 0)
#define PA04_OPENDRAIN_ENABLE()             (CW_GPIOA->OPENDRAIN_f.PIN4  = 1)
#define PA05_PUSHPULL_ENABLE()              (CW_GPIOA->OPENDRAIN_f.PIN5  = 0)
#define PA05_OPENDRAIN_ENABLE()             (CW_GPIOA->OPENDRAIN_f.PIN5  = 1)
#define PA06_PUSHPULL_ENABLE()              (CW_GPIOA->OPENDRAIN_f.PIN6  = 0)
#define PA06_OPENDRAIN_ENABLE()             (CW_GPIOA->OPENDRAIN_f.PIN6  = 1)
#define PA07_PUSHPULL_ENABLE()              (CW_GPIOA->OPENDRAIN_f.PIN7  = 0)
#define PA07_OPENDRAIN_ENABLE()             (CW_GPIOA->OPENDRAIN_f.PIN7  = 1)
#define PA08_PUSHPULL_ENABLE()              (CW_GPIOA->OPENDRAIN_f.PIN8  = 0)
#define PA08_OPENDRAIN_ENABLE()             (CW_GPIOA->OPENDRAIN_f.PIN8  = 1)
#define PA09_PUSHPULL_ENABLE()              (CW_GPIOA->OPENDRAIN_f.PIN9  = 0)
#define PA09_OPENDRAIN_ENABLE()             (CW_GPIOA->OPENDRAIN_f.PIN9  = 1)
#define PA10_PUSHPULL_ENABLE()              (CW_GPIOA->OPENDRAIN_f.PIN10 = 0)
#define PA10_OPENDRAIN_ENABLE()             (CW_GPIOA->OPENDRAIN_f.PIN10 = 1)
#define PA11_PUSHPULL_ENABLE()              (CW_GPIOA->OPENDRAIN_f.PIN11 = 0)
#define PA11_OPENDRAIN_ENABLE()             (CW_GPIOA->OPENDRAIN_f.PIN11 = 1)
#define PA12_PUSHPULL_ENABLE()              (CW_GPIOA->OPENDRAIN_f.PIN12 = 0)
#define PA12_OPENDRAIN_ENABLE()             (CW_GPIOA->OPENDRAIN_f.PIN12 = 1)
#define PA13_PUSHPULL_ENABLE()              (CW_GPIOA->OPENDRAIN_f.PIN13 = 0)
#define PA13_OPENDRAIN_ENABLE()             (CW_GPIOA->OPENDRAIN_f.PIN13 = 1)
#define PA14_PUSHPULL_ENABLE()              (CW_GPIOA->OPENDRAIN_f.PIN14 = 0)
#define PA14_OPENDRAIN_ENABLE()             (CW_GPIOA->OPENDRAIN_f.PIN14 = 1)
#define PA15_PUSHPULL_ENABLE()              (CW_GPIOA->OPENDRAIN_f.PIN15 = 0)
#define PA15_OPENDRAIN_ENABLE()             (CW_GPIOA->OPENDRAIN_f.PIN15 = 1)

