qinikat/CW32-LowPowerBroadcastModule/Libraries/inc/cw32l083_gpio.h
#define PD00_PDR_ENABLE()                   (CW_GPIOD->PDR_f.PIN0  = 1)
#define PD00_PDR_DISABLE()                  (CW_GPIOD->PDR_f.PIN0  = 0)
#define PD01_PDR_ENABLE()                   (CW_GPIOD->PDR_f.PIN1  = 1)
#define PD01_PDR_DISABLE()                  (CW_GPIOD->PDR_f.PIN1  = 0)
#define PD02_PDR_ENABLE()                   (CW_GPIOD->PDR_f.PIN2  = 1)
#define PD02_PDR_DISABLE()                  (CW_GPIOD->PDR_f.PIN2  = 0)
#define PD03_PDR_ENABLE()                   (CW_GPIOD->PDR_f.PIN3  = 1)
#define PD03_PDR_DISABLE()                  (CW_GPIOD->PDR_f.PIN3  = 0)
#define PD04_PDR_ENABLE()                   (CW_GPIOD->PDR_f.PIN4  = 1)
#define PD04_PDR_DISABLE()                  (CW_GPIOD->PDR_f.PIN4  = 0)
#define PD05_PDR_ENABLE()                   (CW_GPIOD->PDR_f.PIN5  = 1)
#define PD05_PDR_DISABLE()                  (CW_GPIOD->PDR_f.PIN5  = 0)
#define PD06_PDR_ENABLE()                   (CW_GPIOD->PDR_f.PIN6  = 1)
#define PD06_PDR_DISABLE()                  (CW_GPIOD->PDR_f.PIN6  = 0)
#define PD07_PDR_ENABLE()                   (CW_GPIOD->PDR_f.PIN7  = 1)
#define PD07_PDR_DISABLE()                  (CW_GPIOD->PDR_f.PIN7  = 0)
#define PD08_PDR_ENABLE()                   (CW_GPIOD->PDR_f.PIN8  = 1)
#define PD08_PDR_DISABLE()                  (CW_GPIOD->PDR_f.PIN8  = 0)
#define PD09_PDR_ENABLE()                   (CW_GPIOD->PDR_f.PIN9  = 1)
#define PD09_PDR_DISABLE()                  (CW_GPIOD->PDR_f.PIN9  = 0)
#define PD10_PDR_ENABLE()                   (CW_GPIOD->PDR_f.PIN10 = 1)
#define PD10_PDR_DISABLE()                  (CW_GPIOD->PDR_f.PIN10 = 0)
#define PD11_PDR_ENABLE()                   (CW_GPIOD->PDR_f.PIN11 = 1)
#define PD11_PDR_DISABLE()                  (CW_GPIOD->PDR_f.PIN11 = 0)
#define PD12_PDR_ENABLE()                   (CW_GPIOD->PDR_f.PIN12 = 1)
#define PD12_PDR_DISABLE()                  (CW_GPIOD->PDR_f.PIN12 = 0)
#define PD13_PDR_ENABLE()                   (CW_GPIOD->PDR_f.PIN13 = 1)
#define PD13_PDR_DISABLE()                  (CW_GPIOD->PDR_f.PIN13 = 0)
#define PD14_PDR_ENABLE()                   (CW_GPIOD->PDR_f.PIN14 = 1)
#define PD14_PDR_DISABLE()                  (CW_GPIOD->PDR_f.PIN14 = 0)
#define PD15_PDR_ENABLE()                   (CW_GPIOD->PDR_f.PIN15 = 1)
#define PD15_PDR_DISABLE()                  (CW_GPIOD->PDR_f.PIN15 = 0)

#define PE00_PDR_ENABLE()                   (CW_GPIOE->PDR_f.PIN0  = 1)
#define PE00_PDR_DISABLE()                  (CW_GPIOE->PDR_f.PIN0  = 0)
#define PE01_PDR_ENABLE()                   (CW_GPIOE->PDR_f.PIN1  = 1)
#define PE01_PDR_DISABLE()                  (CW_GPIOE->PDR_f.PIN1  = 0)
#define PE02_PDR_ENABLE()                   (CW_GPIOE->PDR_f.PIN2  = 1)
#define PE02_PDR_DISABLE()                  (CW_GPIOE->PDR_f.PIN2  = 0)
#define PE03_PDR_ENABLE()                   (CW_GPIOE->PDR_f.PIN3  = 1)
#define PE03_PDR_DISABLE()                  (CW_GPIOE->PDR_f.PIN3  = 0)
#define PE04_PDR_ENABLE()                   (CW_GPIOE->PDR_f.PIN4  = 1)
#define PE04_PDR_DISABLE()                  (CW_GPIOE->PDR_f.PIN4  = 0)
#define PE05_PDR_ENABLE()                   (CW_GPIOE->PDR_f.PIN5  = 1)
#define PE05_PDR_DISABLE()                  (CW_GPIOE->PDR_f.PIN5  = 0)
#define PE06_PDR_ENABLE()                   (CW_GPIOE->PDR_f.PIN6  = 1)
#define PE06_PDR_DISABLE()                  (CW_GPIOE->PDR_f.PIN6  = 0)
#define PE07_PDR_ENABLE()                   (CW_GPIOE->PDR_f.PIN7  = 1)
#define PE07_PDR_DISABLE()                  (CW_GPIOE->PDR_f.PIN7  = 0)
#define PE08_PDR_ENABLE()                   (CW_GPIOE->PDR_f.PIN8  = 1)
#define PE08_PDR_DISABLE()                  (CW_GPIOE->PDR_f.PIN8  = 0)
#define PE09_PDR_ENABLE()                   (CW_GPIOE->PDR_f.PIN9  = 1)
#define PE09_PDR_DISABLE()                  (CW_GPIOE->PDR_f.PIN9  = 0)
#define PE10_PDR_ENABLE()                   (CW_GPIOE->PDR_f.PIN10 = 1)
#define PE10_PDR_DISABLE()                  (CW_GPIOE->PDR_f.PIN10 = 0)
#define PE11_PDR_ENABLE()                   (CW_GPIOE->PDR_f.PIN11 = 1)
#define PE11_PDR_DISABLE()                  (CW_GPIOE->PDR_f.PIN11 = 0)
#define PE12_PDR_ENABLE()                   (CW_GPIOE->PDR_f.PIN12 = 1)
#define PE12_PDR_DISABLE()                  (CW_GPIOE->PDR_f.PIN12 = 0)
#define PE13_PDR_ENABLE()                   (CW_GPIOE->PDR_f.PIN13 = 1)
#define PE13_PDR_DISABLE()                  (CW_GPIOE->PDR_f.PIN13 = 0)
#define PE14_PDR_ENABLE()                   (CW_GPIOE->PDR_f.PIN14 = 1)
#define PE14_PDR_DISABLE()                  (CW_GPIOE->PDR_f.PIN14 = 0)
#define PE15_PDR_ENABLE()                   (CW_GPIOE->PDR_f.PIN15 = 1)
#define PE15_PDR_DISABLE()                  (CW_GPIOE->PDR_f.PIN15 = 0)

#define PF00_PDR_ENABLE()                   (CW_GPIOF->PDR_f.PIN0  = 1)
#define PF00_PDR_DISABLE()                  (CW_GPIOF->PDR_f.PIN0  = 0)
#define PF01_PDR_ENABLE()                   (CW_GPIOF->PDR_f.PIN1  = 1)
#define PF01_PDR_DISABLE()                  (CW_GPIOF->PDR_f.PIN1  = 0)
#define PF02_PDR_ENABLE()                   (CW_GPIOF->PDR_f.PIN2  = 1)
#define PF02_PDR_DISABLE()                  (CW_GPIOF->PDR_f.PIN2  = 0)
#define PF03_PDR_ENABLE()                   (CW_GPIOF->PDR_f.PIN3  = 1)
#define PF03_PDR_DISABLE()                  (CW_GPIOF->PDR_f.PIN3  = 0)
#define PF04_PDR_ENABLE()                   (CW_GPIOF->PDR_f.PIN4  = 1)
#define PF04_PDR_DISABLE()                  (CW_GPIOF->PDR_f.PIN4  = 0)
#define PF05_PDR_ENABLE()                   (CW_GPIOF->PDR_f.PIN5  = 1)
#define PF05_PDR_DISABLE()                  (CW_GPIOF->PDR_f.PIN5  = 0)
#define PF06_PDR_ENABLE()                   (CW_GPIOF->PDR_f.PIN6  = 1)
#define PF06_PDR_DISABLE()                  (CW_GPIOF->PDR_f.PIN6  = 0)
#define PF07_PDR_ENABLE()                   (CW_GPIOF->PDR_f.PIN7  = 1)
#define PF07_PDR_DISABLE()                  (CW_GPIOF->PDR_f.PIN7  = 0)
#define PF08_PDR_ENABLE()                   (CW_GPIOF->PDR_f.PIN8  = 1)
#define PF08_PDR_DISABLE()                  (CW_GPIOF->PDR_f.PIN8  = 0)
#define PF09_PDR_ENABLE()                   (CW_GPIOF->PDR_f.PIN9  = 1)
#define PF09_PDR_DISABLE()                  (CW_GPIOF->PDR_f.PIN9  = 0)
#define PF10_PDR_ENABLE()                   (CW_GPIOF->PDR_f.PIN10 = 1)
#define PF10_PDR_DISABLE()                  (CW_GPIOF->PDR_f.PIN10 = 0)

//============================================================
// GETVALUE
#define PA00_GETVALUE()                     (!!(CW_GPIOA->IDR & bv0))
#define PA01_GETVALUE()                     (!!(CW_GPIOA->IDR & bv1))
#define PA02_GETVALUE()                     (!!(CW_GPIOA->IDR & bv2))
#define PA03_GETVALUE()                     (!!(CW_GPIOA->IDR & bv3))
#define PA04_GETVALUE()                     (!!(CW_GPIOA->IDR & bv4))
#define PA05_GETVALUE()                     (!!(CW_GPIOA->IDR & bv5))
#define PA06_GETVALUE()                     (!!(CW_GPIOA->IDR & bv6))
#define PA07_GETVALUE()                     (!!(CW_GPIOA->IDR & bv7))
#define PA08_GETVALUE()                     (!!(CW_GPIOA->IDR & bv8))
#define PA09_GETVALUE()                     (!!(CW_GPIOA->IDR & bv9))
#define PA10_GETVALUE()                     (!!(CW_GPIOA->IDR & bv10))
#define PA11_GETVALUE()                     (!!(CW_GPIOA->IDR & bv11))
#define PA12_GETVALUE()                     (!!(CW_GPIOA->IDR & bv12))
#define PA13_GETVALUE()                     (!!(CW_GPIOA->IDR & bv13))
#define PA14_GETVALUE()                     (!!(CW_GPIOA->IDR & bv14))
#define PA15_GETVALUE()                     (!!(CW_GPIOA->IDR & bv15))

#define PB00_GETVALUE()                     (!!(CW_GPIOB->IDR & bv0))
#define PB01_GETVALUE()                     (!!(CW_GPIOB->IDR & bv1))
#define PB02_GETVALUE()                     (!!(CW_GPIOB->IDR & bv2))
#define PB03_GETVALUE()                     (!!(CW_GPIOB->IDR & bv3))
#define PB04_GETVALUE()                     (!!(CW_GPIOB->IDR & bv4))
#define PB05_GETVALUE()                     (!!(CW_GPIOB->IDR & bv5))
#define PB06_GETVALUE()                     (!!(CW_GPIOB->IDR & bv6))
#define PB07_GETVALUE()                     (!!(CW_GPIOB->IDR & bv7))
#define PB08_GETVALUE()                     (!!(CW_GPIOB->IDR & bv8))
#define PB09_GETVALUE()                     (!!(CW_GPIOB->IDR & bv9))
#define PB10_GETVALUE()                     (!!(CW_GPIOB->IDR & bv10))
#define PB11_GETVALUE()                     (!!(CW_GPIOB->IDR & bv11))
#define PB12_GETVALUE()                     (!!(CW_GPIOB->IDR & bv12))
#define PB13_GETVALUE()                     (!!(CW_GPIOB->IDR & bv13))
#define PB14_GETVALUE()                     (!!(CW_GPIOB->IDR & bv14))
#define PB15_GETVALUE()                     (!!(CW_GPIOB->IDR & bv15))

#define PC00_GETVALUE()                     (!!(CW_GPIOC->IDR & bv0))
#define PC01_GETVALUE()                     (!!(CW_GPIOC->IDR & bv1))
#define PC02_GETVALUE()                     (!!(CW_GPIOC->IDR & bv2))
#define PC03_GETVALUE()                     (!!(CW_GPIOC->IDR & bv3))
#define PC04_GETVALUE()                     (!!(CW_GPIOC->IDR & bv4))
#define PC05_GETVALUE()                     (!!(CW_GPIOC->IDR & bv5))
#define PC06_GETVALUE()                     (!!(CW_GPIOC->IDR & bv6))
#define PC07_GETVALUE()                     (!!(CW_GPIOC->IDR & bv7))
#define PC08_GETVALUE()                     (!!(CW_GPIOC->IDR & bv8))
#define PC09_GETVALUE()                     (!!(CW_GPIOC->IDR & bv9))
#define PC10_GETVALUE()                     (!!(CW_GPIOC->IDR & bv10))
#define PC11_GETVALUE()                     (!!(CW_GPIOC->IDR & bv11))
#define PC12_GETVALUE()                     (!!(CW_GPIOC->IDR & bv12))
#define PC13_GETVALUE()                     (!!(CW_GPIOC->IDR & bv13))
#define PC14_GETVALUE()                     (!!(CW_GPIOC->IDR & bv14))
#define PC15_GETVALUE()                     (!!(CW_GPIOC->IDR & bv15))

