qinikat/CW32-LowPowerBroadcastModule/Libraries/inc/cw32l083_gpio.h
#define PD00_GETVALUE()                     (!!(CW_GPIOD->IDR & bv0))
#define PD01_GETVALUE()                     (!!(CW_GPIOD->IDR & bv1))
#define PD02_GETVALUE()                     (!!(CW_GPIOD->IDR & bv2))
#define PD03_GETVALUE()                     (!!(CW_GPIOD->IDR & bv3))
#define PD04_GETVALUE()                     (!!(CW_GPIOD->IDR & bv4))
#define PD05_GETVALUE()                     (!!(CW_GPIOD->IDR & bv5))
#define PD06_GETVALUE()                     (!!(CW_GPIOD->IDR & bv6))
#define PD07_GETVALUE()                     (!!(CW_GPIOD->IDR & bv7))
#define PD08_GETVALUE()                     (!!(CW_GPIOD->IDR & bv8))
#define PD09_GETVALUE()                     (!!(CW_GPIOD->IDR & bv9))
#define PD10_GETVALUE()                     (!!(CW_GPIOD->IDR & bv10))
#define PD11_GETVALUE()                     (!!(CW_GPIOD->IDR & bv11))
#define PD12_GETVALUE()                     (!!(CW_GPIOD->IDR & bv12))
#define PD13_GETVALUE()                     (!!(CW_GPIOD->IDR & bv13))
#define PD14_GETVALUE()                     (!!(CW_GPIOD->IDR & bv14))
#define PD15_GETVALUE()                     (!!(CW_GPIOD->IDR & bv15))

#define PE00_GETVALUE()                     (!!(CW_GPIOE->IDR & bv0))
#define PE01_GETVALUE()                     (!!(CW_GPIOE->IDR & bv1))
#define PE02_GETVALUE()                     (!!(CW_GPIOE->IDR & bv2))
#define PE03_GETVALUE()                     (!!(CW_GPIOE->IDR & bv3))
#define PE04_GETVALUE()                     (!!(CW_GPIOE->IDR & bv4))
#define PE05_GETVALUE()                     (!!(CW_GPIOE->IDR & bv5))
#define PE06_GETVALUE()                     (!!(CW_GPIOE->IDR & bv6))
#define PE07_GETVALUE()                     (!!(CW_GPIOE->IDR & bv7))
#define PE08_GETVALUE()                     (!!(CW_GPIOE->IDR & bv8))
#define PE09_GETVALUE()                     (!!(CW_GPIOE->IDR & bv9))
#define PE10_GETVALUE()                     (!!(CW_GPIOE->IDR & bv10))
#define PE11_GETVALUE()                     (!!(CW_GPIOE->IDR & bv11))
#define PE12_GETVALUE()                     (!!(CW_GPIOE->IDR & bv12))
#define PE13_GETVALUE()                     (!!(CW_GPIOE->IDR & bv13))
#define PE14_GETVALUE()                     (!!(CW_GPIOE->IDR & bv14))
#define PE15_GETVALUE()                     (!!(CW_GPIOE->IDR & bv15))

#define PF00_GETVALUE()                     (!!(CW_GPIOF->IDR & bv0))
#define PF01_GETVALUE()                     (!!(CW_GPIOF->IDR & bv1))
#define PF02_GETVALUE()                     (!!(CW_GPIOF->IDR & bv2))
#define PF03_GETVALUE()                     (!!(CW_GPIOF->IDR & bv3))
#define PF04_GETVALUE()                     (!!(CW_GPIOF->IDR & bv4))
#define PF05_GETVALUE()                     (!!(CW_GPIOF->IDR & bv5))
#define PF06_GETVALUE()                     (!!(CW_GPIOF->IDR & bv6))
#define PF07_GETVALUE()                     (!!(CW_GPIOF->IDR & bv7))
#define PF08_GETVALUE()                     (!!(CW_GPIOF->IDR & bv8))
#define PF09_GETVALUE()                     (!!(CW_GPIOF->IDR & bv9))
#define PF10_GETVALUE()                     (!!(CW_GPIOF->IDR & bv10))

//============================================================
// SET HIGH AND LOW
#define PA00_SETHIGH()                      (CW_GPIOA->BSRR = bv0)
#define PA00_SETLOW()                       (CW_GPIOA->BRR  = bv0)
#define PA01_SETHIGH()                      (CW_GPIOA->BSRR = bv1)
#define PA01_SETLOW()                       (CW_GPIOA->BRR  = bv1)
#define PA02_SETHIGH()                      (CW_GPIOA->BSRR = bv2)
#define PA02_SETLOW()                       (CW_GPIOA->BRR  = bv2)
#define PA03_SETHIGH()                      (CW_GPIOA->BSRR = bv3)
#define PA03_SETLOW()                       (CW_GPIOA->BRR  = bv3)
#define PA04_SETHIGH()                      (CW_GPIOA->BSRR = bv4)
#define PA04_SETLOW()                       (CW_GPIOA->BRR  = bv4)
#define PA05_SETHIGH()                      (CW_GPIOA->BSRR = bv5)
#define PA05_SETLOW()                       (CW_GPIOA->BRR  = bv5)
#define PA06_SETHIGH()                      (CW_GPIOA->BSRR = bv6)
#define PA06_SETLOW()                       (CW_GPIOA->BRR  = bv6)
#define PA07_SETHIGH()                      (CW_GPIOA->BSRR = bv7)
#define PA07_SETLOW()                       (CW_GPIOA->BRR  = bv7)
#define PA08_SETHIGH()                      (CW_GPIOA->BSRR = bv8)
#define PA08_SETLOW()                       (CW_GPIOA->BRR  = bv8)
#define PA09_SETHIGH()                      (CW_GPIOA->BSRR = bv9)
#define PA09_SETLOW()                       (CW_GPIOA->BRR  = bv9)
#define PA10_SETHIGH()                      (CW_GPIOA->BSRR = bv10)
#define PA10_SETLOW()                       (CW_GPIOA->BRR  = bv10)
#define PA11_SETHIGH()                      (CW_GPIOA->BSRR = bv11)
#define PA11_SETLOW()                       (CW_GPIOA->BRR  = bv11)
#define PA12_SETHIGH()                      (CW_GPIOA->BSRR = bv12)
#define PA12_SETLOW()                       (CW_GPIOA->BRR  = bv12)
#define PA13_SETHIGH()                      (CW_GPIOA->BSRR = bv13)
#define PA13_SETLOW()                       (CW_GPIOA->BRR  = bv13)
#define PA14_SETHIGH()                      (CW_GPIOA->BSRR = bv14)
#define PA14_SETLOW()                       (CW_GPIOA->BRR  = bv14)
#define PA15_SETHIGH()                      (CW_GPIOA->BSRR = bv15)
#define PA15_SETLOW()                       (CW_GPIOA->BRR  = bv15)

#define PB00_SETHIGH()                      (CW_GPIOB->BSRR = bv0)
#define PB00_SETLOW()                       (CW_GPIOB->BRR  = bv0)
#define PB01_SETHIGH()                      (CW_GPIOB->BSRR = bv1)
#define PB01_SETLOW()                       (CW_GPIOB->BRR  = bv1)
#define PB02_SETHIGH()                      (CW_GPIOB->BSRR = bv2)
#define PB02_SETLOW()                       (CW_GPIOB->BRR  = bv2)
#define PB03_SETHIGH()                      (CW_GPIOB->BSRR = bv3)
#define PB03_SETLOW()                       (CW_GPIOB->BRR  = bv3)
#define PB04_SETHIGH()                      (CW_GPIOB->BSRR = bv4)
#define PB04_SETLOW()                       (CW_GPIOB->BRR  = bv4)
#define PB05_SETHIGH()                      (CW_GPIOB->BSRR = bv5)
#define PB05_SETLOW()                       (CW_GPIOB->BRR  = bv5)
#define PB06_SETHIGH()                      (CW_GPIOB->BSRR = bv6)
#define PB06_SETLOW()                       (CW_GPIOB->BRR  = bv6)
#define PB07_SETHIGH()                      (CW_GPIOB->BSRR = bv7)
#define PB07_SETLOW()                       (CW_GPIOB->BRR  = bv7)
#define PB08_SETHIGH()                      (CW_GPIOB->BSRR = bv8)
#define PB08_SETLOW()                       (CW_GPIOB->BRR  = bv8)
#define PB09_SETHIGH()                      (CW_GPIOB->BSRR = bv9)
#define PB09_SETLOW()                       (CW_GPIOB->BRR  = bv9)
#define PB10_SETHIGH()                      (CW_GPIOB->BSRR = bv10)
#define PB10_SETLOW()                       (CW_GPIOB->BRR  = bv10)
#define PB11_SETHIGH()                      (CW_GPIOB->BSRR = bv11)
#define PB11_SETLOW()                       (CW_GPIOB->BRR  = bv11)
#define PB12_SETHIGH()                      (CW_GPIOB->BSRR = bv12)
#define PB12_SETLOW()                       (CW_GPIOB->BRR  = bv12)
#define PB13_SETHIGH()                      (CW_GPIOB->BSRR = bv13)
#define PB13_SETLOW()                       (CW_GPIOB->BRR  = bv13)
#define PB14_SETHIGH()                      (CW_GPIOB->BSRR = bv14)
#define PB14_SETLOW()                       (CW_GPIOB->BRR  = bv14)
#define PB15_SETHIGH()                      (CW_GPIOB->BSRR = bv15)
#define PB15_SETLOW()                       (CW_GPIOB->BRR  = bv15)

