qinikat/CW32-LowPowerBroadcastModule/Libraries/inc/cw32l083_gpio.h
#define PC00_SETHIGH()                      (CW_GPIOC->BSRR = bv0)
#define PC00_SETLOW()                       (CW_GPIOC->BRR  = bv0)
#define PC01_SETHIGH()                      (CW_GPIOC->BSRR = bv1)
#define PC01_SETLOW()                       (CW_GPIOC->BRR  = bv1)
#define PC02_SETHIGH()                      (CW_GPIOC->BSRR = bv2)
#define PC02_SETLOW()                       (CW_GPIOC->BRR  = bv2)
#define PC03_SETHIGH()                      (CW_GPIOC->BSRR = bv3)
#define PC03_SETLOW()                       (CW_GPIOC->BRR  = bv3)
#define PC04_SETHIGH()                      (CW_GPIOC->BSRR = bv4)
#define PC04_SETLOW()                       (CW_GPIOC->BRR  = bv4)
#define PC05_SETHIGH()                      (CW_GPIOC->BSRR = bv5)
#define PC05_SETLOW()                       (CW_GPIOC->BRR  = bv5)
#define PC06_SETHIGH()                      (CW_GPIOC->BSRR = bv6)
#define PC06_SETLOW()                       (CW_GPIOC->BRR  = bv6)
#define PC07_SETHIGH()                      (CW_GPIOC->BSRR = bv7)
#define PC07_SETLOW()                       (CW_GPIOC->BRR  = bv7)
#define PC08_SETHIGH()                      (CW_GPIOC->BSRR = bv8)
#define PC08_SETLOW()                       (CW_GPIOC->BRR  = bv8)
#define PC09_SETHIGH()                      (CW_GPIOC->BSRR = bv9)
#define PC09_SETLOW()                       (CW_GPIOC->BRR  = bv9)
#define PC10_SETHIGH()                      (CW_GPIOC->BSRR = bv10)
#define PC10_SETLOW()                       (CW_GPIOC->BRR  = bv10)
#define PC11_SETHIGH()                      (CW_GPIOC->BSRR = bv11)
#define PC11_SETLOW()                       (CW_GPIOC->BRR  = bv11)
#define PC12_SETHIGH()                      (CW_GPIOC->BSRR = bv12)
#define PC12_SETLOW()                       (CW_GPIOC->BRR  = bv12)
#define PC13_SETHIGH()                      (CW_GPIOC->BSRR = bv13)
#define PC13_SETLOW()                       (CW_GPIOC->BRR  = bv13)
#define PC14_SETHIGH()                      (CW_GPIOC->BSRR = bv14)
#define PC14_SETLOW()                       (CW_GPIOC->BRR  = bv14)
#define PC15_SETHIGH()                      (CW_GPIOC->BSRR = bv15)
#define PC15_SETLOW()                       (CW_GPIOC->BRR  = bv15)

#define PD00_SETHIGH()                      (CW_GPIOD->BSRR = bv0)
#define PD00_SETLOW()                       (CW_GPIOD->BRR  = bv0)
#define PD01_SETHIGH()                      (CW_GPIOD->BSRR = bv1)
#define PD01_SETLOW()                       (CW_GPIOD->BRR  = bv1)
#define PD02_SETHIGH()                      (CW_GPIOD->BSRR = bv2)
#define PD02_SETLOW()                       (CW_GPIOD->BRR  = bv2)
#define PD03_SETHIGH()                      (CW_GPIOD->BSRR = bv3)
#define PD03_SETLOW()                       (CW_GPIOD->BRR  = bv3)
#define PD04_SETHIGH()                      (CW_GPIOD->BSRR = bv4)
#define PD04_SETLOW()                       (CW_GPIOD->BRR  = bv4)
#define PD05_SETHIGH()                      (CW_GPIOD->BSRR = bv5)
#define PD05_SETLOW()                       (CW_GPIOD->BRR  = bv5)
#define PD06_SETHIGH()                      (CW_GPIOD->BSRR = bv6)
#define PD06_SETLOW()                       (CW_GPIOD->BRR  = bv6)
#define PD07_SETHIGH()                      (CW_GPIOD->BSRR = bv7)
#define PD07_SETLOW()                       (CW_GPIOD->BRR  = bv7)
#define PD08_SETHIGH()                      (CW_GPIOD->BSRR = bv8)
#define PD08_SETLOW()                       (CW_GPIOD->BRR  = bv8)
#define PD09_SETHIGH()                      (CW_GPIOD->BSRR = bv9)
#define PD09_SETLOW()                       (CW_GPIOD->BRR  = bv9)
#define PD10_SETHIGH()                      (CW_GPIOD->BSRR = bv10)
#define PD10_SETLOW()                       (CW_GPIOD->BRR  = bv10)
#define PD11_SETHIGH()                      (CW_GPIOD->BSRR = bv11)
#define PD11_SETLOW()                       (CW_GPIOD->BRR  = bv11)
#define PD12_SETHIGH()                      (CW_GPIOD->BSRR = bv12)
#define PD12_SETLOW()                       (CW_GPIOD->BRR  = bv12)
#define PD13_SETHIGH()                      (CW_GPIOD->BSRR = bv13)
#define PD13_SETLOW()                       (CW_GPIOD->BRR  = bv13)
#define PD14_SETHIGH()                      (CW_GPIOD->BSRR = bv14)
#define PD14_SETLOW()                       (CW_GPIOD->BRR  = bv14)
#define PD15_SETHIGH()                      (CW_GPIOD->BSRR = bv15)
#define PD15_SETLOW()                       (CW_GPIOD->BRR  = bv15)

#define PE00_SETHIGH()                      (CW_GPIOE->BSRR = bv0)
#define PE00_SETLOW()                       (CW_GPIOE->BRR  = bv0)
#define PE01_SETHIGH()                      (CW_GPIOE->BSRR = bv1)
#define PE01_SETLOW()                       (CW_GPIOE->BRR  = bv1)
#define PE02_SETHIGH()                      (CW_GPIOE->BSRR = bv2)
#define PE02_SETLOW()                       (CW_GPIOE->BRR  = bv2)
#define PE03_SETHIGH()                      (CW_GPIOE->BSRR = bv3)
#define PE03_SETLOW()                       (CW_GPIOE->BRR  = bv3)
#define PE04_SETHIGH()                      (CW_GPIOE->BSRR = bv4)
#define PE04_SETLOW()                       (CW_GPIOE->BRR  = bv4)
#define PE05_SETHIGH()                      (CW_GPIOE->BSRR = bv5)
#define PE05_SETLOW()                       (CW_GPIOE->BRR  = bv5)
#define PE06_SETHIGH()                      (CW_GPIOE->BSRR = bv6)
#define PE06_SETLOW()                       (CW_GPIOE->BRR  = bv6)
#define PE07_SETHIGH()                      (CW_GPIOE->BSRR = bv7)
#define PE07_SETLOW()                       (CW_GPIOE->BRR  = bv7)
#define PE08_SETHIGH()                      (CW_GPIOE->BSRR = bv8)
#define PE08_SETLOW()                       (CW_GPIOE->BRR  = bv8)
#define PE09_SETHIGH()                      (CW_GPIOE->BSRR = bv9)
#define PE09_SETLOW()                       (CW_GPIOE->BRR  = bv9)
#define PE10_SETHIGH()                      (CW_GPIOE->BSRR = bv10)
#define PE10_SETLOW()                       (CW_GPIOE->BRR  = bv10)
#define PE11_SETHIGH()                      (CW_GPIOE->BSRR = bv11)
#define PE11_SETLOW()                       (CW_GPIOE->BRR  = bv11)
#define PE12_SETHIGH()                      (CW_GPIOE->BSRR = bv12)
#define PE12_SETLOW()                       (CW_GPIOE->BRR  = bv12)
#define PE13_SETHIGH()                      (CW_GPIOE->BSRR = bv13)
#define PE13_SETLOW()                       (CW_GPIOE->BRR  = bv13)
#define PE14_SETHIGH()                      (CW_GPIOE->BSRR = bv14)
#define PE14_SETLOW()                       (CW_GPIOE->BRR  = bv14)
#define PE15_SETHIGH()                      (CW_GPIOE->BSRR = bv15)
#define PE15_SETLOW()                       (CW_GPIOE->BRR  = bv15)

#define PF00_SETHIGH()                      (CW_GPIOF->BSRR = bv0)
#define PF00_SETLOW()                       (CW_GPIOF->BRR  = bv0)
#define PF01_SETHIGH()                      (CW_GPIOF->BSRR = bv1)
#define PF01_SETLOW()                       (CW_GPIOF->BRR  = bv1)
#define PF02_SETHIGH()                      (CW_GPIOF->BSRR = bv2)
#define PF02_SETLOW()                       (CW_GPIOF->BRR  = bv2)
#define PF03_SETHIGH()                      (CW_GPIOF->BSRR = bv3)
#define PF03_SETLOW()                       (CW_GPIOF->BRR  = bv3)
#define PF04_SETHIGH()                      (CW_GPIOF->BSRR = bv4)
#define PF04_SETLOW()                       (CW_GPIOF->BRR  = bv4)
#define PF05_SETHIGH()                      (CW_GPIOF->BSRR = bv5)
#define PF05_SETLOW()                       (CW_GPIOF->BRR  = bv5)
#define PF06_SETHIGH()                      (CW_GPIOF->BSRR = bv6)
#define PF06_SETLOW()                       (CW_GPIOF->BRR  = bv6)
#define PF07_SETHIGH()                      (CW_GPIOF->BSRR = bv7)
#define PF07_SETLOW()                       (CW_GPIOF->BRR  = bv7)
#define PF08_SETHIGH()                      (CW_GPIOF->BSRR = bv8)
#define PF08_SETLOW()                       (CW_GPIOF->BRR  = bv8)
#define PF09_SETHIGH()                      (CW_GPIOF->BSRR = bv9)
#define PF09_SETLOW()                       (CW_GPIOF->BRR  = bv9)
#define PF10_SETHIGH()                      (CW_GPIOF->BSRR = bv10)
#define PF10_SETLOW()                       (CW_GPIOF->BRR  = bv10)

//============================================================
// TOG
#define PA00_TOG()                          (CW_GPIOA->TOG = bv0)
#define PA01_TOG()                          (CW_GPIOA->TOG = bv1)
#define PA02_TOG()                          (CW_GPIOA->TOG = bv2)
#define PA03_TOG()                          (CW_GPIOA->TOG = bv3)
#define PA04_TOG()                          (CW_GPIOA->TOG = bv4)
#define PA05_TOG()                          (CW_GPIOA->TOG = bv5)
#define PA06_TOG()                          (CW_GPIOA->TOG = bv6)
#define PA07_TOG()                          (CW_GPIOA->TOG = bv7)
#define PA08_TOG()                          (CW_GPIOA->TOG = bv8)
#define PA09_TOG()                          (CW_GPIOA->TOG = bv9)
#define PA10_TOG()                          (CW_GPIOA->TOG = bv10)
#define PA11_TOG()                          (CW_GPIOA->TOG = bv11)
#define PA12_TOG()                          (CW_GPIOA->TOG = bv12)
#define PA13_TOG()                          (CW_GPIOA->TOG = bv13)
#define PA14_TOG()                          (CW_GPIOA->TOG = bv14)
#define PA15_TOG()                          (CW_GPIOA->TOG = bv15)

#define PB00_TOG()                          (CW_GPIOB->TOG = bv0)
#define PB01_TOG()                          (CW_GPIOB->TOG = bv1)
#define PB02_TOG()                          (CW_GPIOB->TOG = bv2)
#define PB03_TOG()                          (CW_GPIOB->TOG = bv3)
#define PB04_TOG()                          (CW_GPIOB->TOG = bv4)
#define PB05_TOG()                          (CW_GPIOB->TOG = bv5)
#define PB06_TOG()                          (CW_GPIOB->TOG = bv6)
#define PB07_TOG()                          (CW_GPIOB->TOG = bv7)
#define PB08_TOG()                          (CW_GPIOB->TOG = bv8)
#define PB09_TOG()                          (CW_GPIOB->TOG = bv9)
#define PB10_TOG()                          (CW_GPIOB->TOG = bv10)
#define PB11_TOG()                          (CW_GPIOB->TOG = bv11)
#define PB12_TOG()                          (CW_GPIOB->TOG = bv12)
#define PB13_TOG()                          (CW_GPIOB->TOG = bv13)
#define PB14_TOG()                          (CW_GPIOB->TOG = bv14)
#define PB15_TOG()                          (CW_GPIOB->TOG = bv15)

#define PC00_TOG()                          (CW_GPIOC->TOG = bv0)
#define PC01_TOG()                          (CW_GPIOC->TOG = bv1)
#define PC02_TOG()                          (CW_GPIOC->TOG = bv2)
#define PC03_TOG()                          (CW_GPIOC->TOG = bv3)
#define PC04_TOG()                          (CW_GPIOC->TOG = bv4)
#define PC05_TOG()                          (CW_GPIOC->TOG = bv5)
#define PC06_TOG()                          (CW_GPIOC->TOG = bv6)
#define PC07_TOG()                          (CW_GPIOC->TOG = bv7)
#define PC08_TOG()                          (CW_GPIOC->TOG = bv8)
#define PC09_TOG()                          (CW_GPIOC->TOG = bv9)
#define PC10_TOG()                          (CW_GPIOC->TOG = bv10)
#define PC11_TOG()                          (CW_GPIOC->TOG = bv11)
#define PC12_TOG()                          (CW_GPIOC->TOG = bv12)
#define PC13_TOG()                          (CW_GPIOC->TOG = bv13)
#define PC14_TOG()                          (CW_GPIOC->TOG = bv14)
#define PC15_TOG()                          (CW_GPIOC->TOG = bv15)

#define PD00_TOG()                          (CW_GPIOD->TOG = bv0)
#define PD01_TOG()                          (CW_GPIOD->TOG = bv1)
#define PD02_TOG()                          (CW_GPIOD->TOG = bv2)
#define PD03_TOG()                          (CW_GPIOD->TOG = bv3)
#define PD04_TOG()                          (CW_GPIOD->TOG = bv4)
#define PD05_TOG()                          (CW_GPIOD->TOG = bv5)
#define PD06_TOG()                          (CW_GPIOD->TOG = bv6)
#define PD07_TOG()                          (CW_GPIOD->TOG = bv7)
#define PD08_TOG()                          (CW_GPIOD->TOG = bv8)
#define PD09_TOG()                          (CW_GPIOD->TOG = bv9)
#define PD10_TOG()                          (CW_GPIOD->TOG = bv10)
#define PD11_TOG()                          (CW_GPIOD->TOG = bv11)
#define PD12_TOG()                          (CW_GPIOD->TOG = bv12)
#define PD13_TOG()                          (CW_GPIOD->TOG = bv13)
#define PD14_TOG()                          (CW_GPIOD->TOG = bv14)
#define PD15_TOG()                          (CW_GPIOD->TOG = bv15)

