qinikat/CW32-LowPowerBroadcastModule/Libraries/inc/cw32l083_gpio.h
#define PE00_TOG()                          (CW_GPIOE->TOG = bv0)
#define PE01_TOG()                          (CW_GPIOE->TOG = bv1)
#define PE02_TOG()                          (CW_GPIOE->TOG = bv2)
#define PE03_TOG()                          (CW_GPIOE->TOG = bv3)
#define PE04_TOG()                          (CW_GPIOE->TOG = bv4)
#define PE05_TOG()                          (CW_GPIOE->TOG = bv5)
#define PE06_TOG()                          (CW_GPIOE->TOG = bv6)
#define PE07_TOG()                          (CW_GPIOE->TOG = bv7)
#define PE08_TOG()                          (CW_GPIOE->TOG = bv8)
#define PE09_TOG()                          (CW_GPIOE->TOG = bv9)
#define PE10_TOG()                          (CW_GPIOE->TOG = bv10)
#define PE11_TOG()                          (CW_GPIOE->TOG = bv11)
#define PE12_TOG()                          (CW_GPIOE->TOG = bv12)
#define PE13_TOG()                          (CW_GPIOE->TOG = bv13)
#define PE14_TOG()                          (CW_GPIOE->TOG = bv14)
#define PE15_TOG()                          (CW_GPIOE->TOG = bv15)

#define PF00_TOG()                          (CW_GPIOF->TOG = bv0)
#define PF01_TOG()                          (CW_GPIOF->TOG = bv1)
#define PF02_TOG()                          (CW_GPIOF->TOG = bv2)
#define PF03_TOG()                          (CW_GPIOF->TOG = bv3)
#define PF04_TOG()                          (CW_GPIOF->TOG = bv4)
#define PF05_TOG()                          (CW_GPIOF->TOG = bv5)
#define PF06_TOG()                          (CW_GPIOF->TOG = bv6)
#define PF07_TOG()                          (CW_GPIOF->TOG = bv7)
#define PF08_TOG()                          (CW_GPIOF->TOG = bv8)
#define PF09_TOG()                          (CW_GPIOF->TOG = bv9)
#define PF10_TOG()                          (CW_GPIOF->TOG = bv10)

//============================================================
// AF0 - AF7
#define PA00_AFx_GPIO()                     (CW_GPIOA->AFRL_f.AFR0  = 0)
#define PA00_AFx_UART3CTS()                 (CW_GPIOA->AFRL_f.AFR0  = 1)
#define PA00_AFx_UART6CTS()                 (CW_GPIOA->AFRL_f.AFR0  = 2)
#define PA00_AFx_RTCTAMP()                  (CW_GPIOA->AFRL_f.AFR0  = 3)
#define PA00_AFx_VC1OUT()                   (CW_GPIOA->AFRL_f.AFR0  = 4)
#define PA00_AFx_SPI2MISO()                 (CW_GPIOA->AFRL_f.AFR0  = 5)
#define PA00_AFx_GTIM2CH1()                 (CW_GPIOA->AFRL_f.AFR0  = 6)
#define PA00_AFx_GTIM2ETR()                 (CW_GPIOA->AFRL_f.AFR0  = 7)
#define PA01_AFx_GPIO()                     (CW_GPIOA->AFRL_f.AFR1  = 0)
#define PA01_AFx_UART3RTS()                 (CW_GPIOA->AFRL_f.AFR1  = 1)
#define PA01_AFx_UART6RTS()                 (CW_GPIOA->AFRL_f.AFR1  = 2)
#define PA01_AFx_I2C2SCL()                  (CW_GPIOA->AFRL_f.AFR1  = 3)
#define PA01_AFx_LVDOUT()                   (CW_GPIOA->AFRL_f.AFR1  = 4)
#define PA01_AFx_SPI2MOSI()                 (CW_GPIOA->AFRL_f.AFR1  = 5)
#define PA01_AFx_GTIM2CH2()                 (CW_GPIOA->AFRL_f.AFR1  = 6)
#define PA01_AFx_RTCTAMP()                  (CW_GPIOA->AFRL_f.AFR1  = 7)
#define PA02_AFx_GPIO()                     (CW_GPIOA->AFRL_f.AFR2  = 0)
#define PA02_AFx_UART3TXD()                 (CW_GPIOA->AFRL_f.AFR2  = 1)
#define PA02_AFx_UART6TXD()                 (CW_GPIOA->AFRL_f.AFR2  = 2)
#define PA02_AFx_I2C2SDA()                  (CW_GPIOA->AFRL_f.AFR2  = 3)
#define PA02_AFx_VC2OUT()                   (CW_GPIOA->AFRL_f.AFR2  = 4)
#define PA02_AFx_SPI2SCK()                  (CW_GPIOA->AFRL_f.AFR2  = 5)
#define PA02_AFx_GTIM2CH3()                 (CW_GPIOA->AFRL_f.AFR2  = 6)
#define PA02_AFx_AUTOTRIMETR()              (CW_GPIOA->AFRL_f.AFR2  = 7)
#define PA03_AFx_GPIO()                     (CW_GPIOA->AFRL_f.AFR3  = 0)
#define PA03_AFx_UART3RXD()                 (CW_GPIOA->AFRL_f.AFR3  = 1)
#define PA03_AFx_UART6RXD()                 (CW_GPIOA->AFRL_f.AFR3  = 2)
#define PA03_AFx_GTIM2CH2()                 (CW_GPIOA->AFRL_f.AFR3  = 3)
#define PA03_AFx_PCLKOUT()                  (CW_GPIOA->AFRL_f.AFR3  = 4)
#define PA03_AFx_SPI2CS()                   (CW_GPIOA->AFRL_f.AFR3  = 5)
#define PA03_AFx_GTIM2CH4()                 (CW_GPIOA->AFRL_f.AFR3  = 6)
#define PA03_AFx_ATIMCH3A()                 (CW_GPIOA->AFRL_f.AFR3  = 7)
#define PA04_AFx_GPIO()                     (CW_GPIOA->AFRL_f.AFR4  = 0)
#define PA04_AFx_UART4TXD()                 (CW_GPIOA->AFRL_f.AFR4  = 1)
#define PA04_AFx_UART2CTS()                 (CW_GPIOA->AFRL_f.AFR4  = 2)
#define PA04_AFx_I2C2SCL()                  (CW_GPIOA->AFRL_f.AFR4  = 3)
#define PA04_AFx_HCLKOUT()                  (CW_GPIOA->AFRL_f.AFR4  = 4)
#define PA04_AFx_SPI1CS()                   (CW_GPIOA->AFRL_f.AFR4  = 5)
#define PA04_AFx_GTIM2ETR()                 (CW_GPIOA->AFRL_f.AFR4  = 6)
#define PA04_AFx_ATIMCH2A()                 (CW_GPIOA->AFRL_f.AFR4  = 7)
#define PA05_AFx_GPIO()                     (CW_GPIOA->AFRL_f.AFR5  = 0)
#define PA05_AFx_GTIM2ETR()                 (CW_GPIOA->AFRL_f.AFR5  = 1)
#define PA05_AFx_UART2RTS()                 (CW_GPIOA->AFRL_f.AFR5  = 2)
#define PA05_AFx_I2C2SDA()                  (CW_GPIOA->AFRL_f.AFR5  = 3)
#define PA05_AFx_BTIM2TOGP()                (CW_GPIOA->AFRL_f.AFR5  = 4)
#define PA05_AFx_SPI1SCK()                  (CW_GPIOA->AFRL_f.AFR5  = 5)
#define PA05_AFx_GTIM2CH1()                 (CW_GPIOA->AFRL_f.AFR5  = 6)
#define PA05_AFx_ATIMCH1A()                 (CW_GPIOA->AFRL_f.AFR5  = 7)
#define PA06_AFx_GPIO()                     (CW_GPIOA->AFRL_f.AFR6  = 0)
#define PA06_AFx_GTIM3CH1()                 (CW_GPIOA->AFRL_f.AFR6  = 1)
#define PA06_AFx_UART2TXD()                 (CW_GPIOA->AFRL_f.AFR6  = 2)
#define PA06_AFx_VC1OUT()                   (CW_GPIOA->AFRL_f.AFR6  = 3)
#define PA06_AFx_BTIM2TOGN()                (CW_GPIOA->AFRL_f.AFR6  = 4)
#define PA06_AFx_SPI1MISO()                 (CW_GPIOA->AFRL_f.AFR6  = 5)
#define PA06_AFx_GTIM1CH1()                 (CW_GPIOA->AFRL_f.AFR6  = 6)
#define PA06_AFx_ATIMBK()                   (CW_GPIOA->AFRL_f.AFR6  = 7)
#define PA07_AFx_GPIO()                     (CW_GPIOA->AFRL_f.AFR7  = 0)
#define PA07_AFx_GTIM4CH1()                 (CW_GPIOA->AFRL_f.AFR7  = 1)
#define PA07_AFx_UART2RXD()                 (CW_GPIOA->AFRL_f.AFR7  = 2)
#define PA07_AFx_VC2OUT()                   (CW_GPIOA->AFRL_f.AFR7  = 3)
#define PA07_AFx_BTIM1TOGP()                (CW_GPIOA->AFRL_f.AFR7  = 4)
#define PA07_AFx_SPI1MOSI()                 (CW_GPIOA->AFRL_f.AFR7  = 5)
#define PA07_AFx_GTIM1CH2()                 (CW_GPIOA->AFRL_f.AFR7  = 6)
#define PA07_AFx_ATIMCH1B()                 (CW_GPIOA->AFRL_f.AFR7  = 7)
#define PA08_AFx_GPIO()                     (CW_GPIOA->AFRH_f.AFR8  = 0)
#define PA08_AFx_LPTIMETR()                 (CW_GPIOA->AFRH_f.AFR8  = 1)
#define PA08_AFx_UART1TXD()                 (CW_GPIOA->AFRH_f.AFR8  = 2)
#define PA08_AFx_BTIM2TOGN()                (CW_GPIOA->AFRH_f.AFR8  = 3)
#define PA08_AFx_MCOOUT()                   (CW_GPIOA->AFRH_f.AFR8  = 4)
#define PA08_AFx_LVDOUT()                   (CW_GPIOA->AFRH_f.AFR8  = 5)
#define PA08_AFx_GTIM3ETR()                 (CW_GPIOA->AFRH_f.AFR8  = 6)
#define PA08_AFx_ATIMCH1A()                 (CW_GPIOA->AFRH_f.AFR8  = 7)
#define PA09_AFx_GPIO()                     (CW_GPIOA->AFRH_f.AFR9  = 0)
#define PA09_AFx_UART3TXD()                 (CW_GPIOA->AFRH_f.AFR9  = 1)
#define PA09_AFx_UART1RXD()                 (CW_GPIOA->AFRH_f.AFR9  = 2)
#define PA09_AFx_I2C1SCL()                  (CW_GPIOA->AFRH_f.AFR9  = 3)
#define PA09_AFx_BTIM1TOGP()                (CW_GPIOA->AFRH_f.AFR9  = 4)
#define PA09_AFx_SPI1CS()                   (CW_GPIOA->AFRH_f.AFR9  = 5)
#define PA09_AFx_GTIM3CH1()                 (CW_GPIOA->AFRH_f.AFR9  = 6)
#define PA09_AFx_ATIMCH2A()                 (CW_GPIOA->AFRH_f.AFR9  = 7)
#define PA10_AFx_GPIO()                     (CW_GPIOA->AFRH_f.AFR10 = 0)
#define PA10_AFx_UART3RXD()                 (CW_GPIOA->AFRH_f.AFR10 = 1)
#define PA10_AFx_UART1CTS()                 (CW_GPIOA->AFRH_f.AFR10 = 2)
#define PA10_AFx_I2C1SDA()                  (CW_GPIOA->AFRH_f.AFR10 = 3)
#define PA10_AFx_BTIM1TOGN()                (CW_GPIOA->AFRH_f.AFR10 = 4)
#define PA10_AFx_SPI1SCK()                  (CW_GPIOA->AFRH_f.AFR10 = 5)
#define PA10_AFx_GTIM3CH2()                 (CW_GPIOA->AFRH_f.AFR10 = 6)
#define PA10_AFx_ATIMCH3A()                 (CW_GPIOA->AFRH_f.AFR10 = 7)
#define PA11_AFx_GPIO()                     (CW_GPIOA->AFRH_f.AFR11 = 0)
#define PA11_AFx_UART3CTS()                 (CW_GPIOA->AFRH_f.AFR11 = 1)
#define PA11_AFx_UART1RTS()                 (CW_GPIOA->AFRH_f.AFR11 = 2)
#define PA11_AFx_I2C2SCL()                  (CW_GPIOA->AFRH_f.AFR11 = 3)
#define PA11_AFx_VC1OUT()                   (CW_GPIOA->AFRH_f.AFR11 = 4)
#define PA11_AFx_SPI1MISO()                 (CW_GPIOA->AFRH_f.AFR11 = 5)
#define PA11_AFx_GTIM3CH3()                 (CW_GPIOA->AFRH_f.AFR11 = 6)
#define PA11_AFx_ATIMGATE()                 (CW_GPIOA->AFRH_f.AFR11 = 7)
#define PA12_AFx_GPIO()                     (CW_GPIOA->AFRH_f.AFR12 = 0)
#define PA12_AFx_UART3RTS()                 (CW_GPIOA->AFRH_f.AFR12 = 1)
#define PA12_AFx_BTIMETR()                  (CW_GPIOA->AFRH_f.AFR12 = 2)
#define PA12_AFx_I2C2SDA()                  (CW_GPIOA->AFRH_f.AFR12 = 3)
#define PA12_AFx_VC2OUT()                   (CW_GPIOA->AFRH_f.AFR12 = 4)
#define PA12_AFx_SPI1MOSI()                 (CW_GPIOA->AFRH_f.AFR12 = 5)
#define PA12_AFx_GTIM3CH4()                 (CW_GPIOA->AFRH_f.AFR12 = 6)
#define PA12_AFx_ATIMETR()                  (CW_GPIOA->AFRH_f.AFR12 = 7)
#define PA13_AFx_GPIO()                     (CW_GPIOA->AFRH_f.AFR13 = 0)
#define PA13_AFx_I2C1SDA()                  (CW_GPIOA->AFRH_f.AFR13 = 2)
#define PA13_AFx_UART1RXD()                 (CW_GPIOA->AFRH_f.AFR13 = 3)
#define PA13_AFx_UART2TXD()                 (CW_GPIOA->AFRH_f.AFR13 = 4)
#define PA13_AFx_I2C2SCL()                  (CW_GPIOA->AFRH_f.AFR13 = 5)
#define PA13_AFx_IROUT()                    (CW_GPIOA->AFRH_f.AFR13 = 6)
#define PA14_AFx_GPIO()                     (CW_GPIOA->AFRH_f.AFR14 = 0)
#define PA14_AFx_UART3TXD()                 (CW_GPIOA->AFRH_f.AFR14 = 1)
#define PA14_AFx_I2C1SCL()                  (CW_GPIOA->AFRH_f.AFR14 = 2)
#define PA14_AFx_UART1TXD()                 (CW_GPIOA->AFRH_f.AFR14 = 3)
#define PA14_AFx_UART2RXD()                 (CW_GPIOA->AFRH_f.AFR14 = 4)
#define PA14_AFx_I2C2SDA()                  (CW_GPIOA->AFRH_f.AFR14 = 5)
#define PA15_AFx_GPIO()                     (CW_GPIOA->AFRH_f.AFR15 = 0)
#define PA15_AFx_UART3RXD()                 (CW_GPIOA->AFRH_f.AFR15 = 1)
#define PA15_AFx_GTIM2CH1()                 (CW_GPIOA->AFRH_f.AFR15 = 2)
#define PA15_AFx_UART1RXD()                 (CW_GPIOA->AFRH_f.AFR15 = 3)
#define PA15_AFx_UART2TXD()                 (CW_GPIOA->AFRH_f.AFR15 = 4)
#define PA15_AFx_SPI1CS()                   (CW_GPIOA->AFRH_f.AFR15 = 5)
#define PA15_AFx_GTIM2ETR()                 (CW_GPIOA->AFRH_f.AFR15 = 6)
#define PA15_AFx_ATIMCH1B()                 (CW_GPIOA->AFRH_f.AFR15 = 7)

