qinikat/CW32-LowPowerBroadcastModule/Libraries/inc/cw32l083_gpio.h
#define PD00_AFx_GPIO()                     (CW_GPIOD->AFRL_f.AFR0  = 0)
#define PD00_AFx_UART6RXD()                 (CW_GPIOD->AFRL_f.AFR0  = 1)
#define PD00_AFx_I2C2SCL()                  (CW_GPIOD->AFRL_f.AFR0  = 3)
#define PD00_AFx_AUTOTRIMETR()              (CW_GPIOD->AFRL_f.AFR0  = 4)
#define PD00_AFx_SPI2CS()                   (CW_GPIOD->AFRL_f.AFR0  = 5)
#define PD00_AFx_MCOOUT()                   (CW_GPIOD->AFRL_f.AFR0  = 6)
#define PD01_AFx_GPIO()                     (CW_GPIOD->AFRL_f.AFR1  = 0)
#define PD01_AFx_UART6TXD()                 (CW_GPIOD->AFRL_f.AFR1  = 1)
#define PD01_AFx_I2C2SDA()                  (CW_GPIOD->AFRL_f.AFR1  = 3)
#define PD01_AFx_RTC1Hz()                   (CW_GPIOD->AFRL_f.AFR1  = 4)
#define PD01_AFx_SPI2SCK()                  (CW_GPIOD->AFRL_f.AFR1  = 5)
#define PD01_AFx_RTCTAMP()                  (CW_GPIOD->AFRL_f.AFR1  = 6)
#define PD02_AFx_GPIO()                     (CW_GPIOD->AFRL_f.AFR2  = 0)
#define PD02_AFx_UART5RXD()                 (CW_GPIOD->AFRL_f.AFR2  = 1)
#define PD02_AFx_GTIM4CH1()                 (CW_GPIOD->AFRL_f.AFR2  = 2)
#define PD02_AFx_BTIMETR()                  (CW_GPIOD->AFRL_f.AFR2  = 3)
#define PD02_AFx_UART6TXD()                 (CW_GPIOD->AFRL_f.AFR2  = 4)
#define PD02_AFx_RTC1Hz()                   (CW_GPIOD->AFRL_f.AFR2  = 5)
#define PD02_AFx_GTIM3ETR()                 (CW_GPIOD->AFRL_f.AFR2  = 6)
#define PD02_AFx_ATIMETR()                  (CW_GPIOD->AFRL_f.AFR2  = 7)
#define PD03_AFx_GPIO()                     (CW_GPIOD->AFRL_f.AFR3  = 0)
#define PD03_AFx_UART6CTS()                 (CW_GPIOD->AFRL_f.AFR3  = 1)
#define PD03_AFx_I2C2SCL()                  (CW_GPIOD->AFRL_f.AFR3  = 3)
#define PD03_AFx_VC1OUT()                   (CW_GPIOD->AFRL_f.AFR3  = 4)
#define PD03_AFx_SPI2MISO()                 (CW_GPIOD->AFRL_f.AFR3  = 5)
#define PD03_AFx_GTIM1CH3()                 (CW_GPIOD->AFRL_f.AFR3  = 6)
#define PD03_AFx_ATIMBK()                   (CW_GPIOD->AFRL_f.AFR3  = 7)
#define PD04_AFx_GPIO()                     (CW_GPIOD->AFRL_f.AFR4  = 0)
#define PD04_AFx_UART6RTS()                 (CW_GPIOD->AFRL_f.AFR4  = 1)
#define PD04_AFx_I2C2SDA()                  (CW_GPIOD->AFRL_f.AFR4  = 3)
#define PD04_AFx_VC2OUT()                   (CW_GPIOD->AFRL_f.AFR4  = 4)
#define PD04_AFx_SPI2MOSI()                 (CW_GPIOD->AFRL_f.AFR4  = 5)
#define PD04_AFx_GTIM1CH4()                 (CW_GPIOD->AFRL_f.AFR4  = 6)
#define PD04_AFx_ATIMCH3A()                 (CW_GPIOD->AFRL_f.AFR4  = 7)
#define PD05_AFx_GPIO()                     (CW_GPIOD->AFRL_f.AFR5  = 0)
#define PD05_AFx_UART4TXD()                 (CW_GPIOD->AFRL_f.AFR5  = 1)
#define PD05_AFx_GTIM2CH1()                 (CW_GPIOD->AFRL_f.AFR5  = 2)
#define PD05_AFx_UART3TXD()                 (CW_GPIOD->AFRL_f.AFR5  = 3)
#define PD05_AFx_LPTIMCH1()                 (CW_GPIOD->AFRL_f.AFR5  = 4)
#define PD05_AFx_BTIM2TOGP()                (CW_GPIOD->AFRL_f.AFR5  = 5)
#define PD05_AFx_LSIOUT()                   (CW_GPIOD->AFRL_f.AFR5  = 6)
#define PD05_AFx_ATIMCH2A()                 (CW_GPIOD->AFRL_f.AFR5  = 7)
#define PD06_AFx_GPIO()                     (CW_GPIOD->AFRL_f.AFR6  = 0)
#define PD06_AFx_I2C1SCL()                  (CW_GPIOD->AFRL_f.AFR6  = 1)
#define PD06_AFx_GTIM2CH4()                 (CW_GPIOD->AFRL_f.AFR6  = 2)
#define PD06_AFx_UART3RXD()                 (CW_GPIOD->AFRL_f.AFR6  = 3)
#define PD06_AFx_LPTIMCH2()                 (CW_GPIOD->AFRL_f.AFR6  = 4)
#define PD06_AFx_BTIM2TOGN()                (CW_GPIOD->AFRL_f.AFR6  = 5)
#define PD06_AFx_GTIM2TOGP()                (CW_GPIOD->AFRL_f.AFR6  = 6)
#define PD06_AFx_ATIMCH1A()                 (CW_GPIOD->AFRL_f.AFR6  = 7)
#define PD07_AFx_GPIO()                     (CW_GPIOD->AFRL_f.AFR7  = 0)
#define PD07_AFx_I2C1SDA()                  (CW_GPIOD->AFRL_f.AFR7  = 1)
#define PD07_AFx_GTIM2CH3()                 (CW_GPIOD->AFRL_f.AFR7  = 2)
#define PD07_AFx_MCOOUT()                   (CW_GPIOD->AFRL_f.AFR7  = 3)
#define PD07_AFx_UART2RXD()                 (CW_GPIOD->AFRL_f.AFR7  = 4)
#define PD07_AFx_SPI1CS()                   (CW_GPIOD->AFRL_f.AFR7  = 5)
#define PD07_AFx_GTIM2TOGN()                (CW_GPIOD->AFRL_f.AFR7  = 6)
#define PD07_AFx_ATIMCH1B()                 (CW_GPIOD->AFRL_f.AFR7  = 7)
#define PD08_AFx_GPIO()                     (CW_GPIOD->AFRH_f.AFR8  = 0)
#define PD08_AFx_GTIM2CH3()                 (CW_GPIOD->AFRH_f.AFR8  = 1)
#define PD08_AFx_LPTIMOUT()                 (CW_GPIOD->AFRH_f.AFR8  = 2)
#define PD08_AFx_UART1TXD()                 (CW_GPIOD->AFRH_f.AFR8  = 3)
#define PD08_AFx_SPI2CS()                   (CW_GPIOD->AFRH_f.AFR8  = 4)
#define PD08_AFx_GTIM1CH1()                 (CW_GPIOD->AFRH_f.AFR8  = 5)
#define PD08_AFx_ATIMCH1A()                 (CW_GPIOD->AFRH_f.AFR8  = 6)
#define PD09_AFx_GPIO()                     (CW_GPIOD->AFRH_f.AFR9  = 0)
#define PD09_AFx_GTIM2CH4()                 (CW_GPIOD->AFRH_f.AFR9  = 1)
#define PD09_AFx_LPTIMCH2()                 (CW_GPIOD->AFRH_f.AFR9  = 2)
#define PD09_AFx_UART1RXD()                 (CW_GPIOD->AFRH_f.AFR9  = 3)
#define PD09_AFx_SPI2SCK()                  (CW_GPIOD->AFRH_f.AFR9  = 4)
#define PD09_AFx_GTIM1CH2()                 (CW_GPIOD->AFRH_f.AFR9  = 5)
#define PD09_AFx_ATIMCH2A()                 (CW_GPIOD->AFRH_f.AFR9  = 6)
#define PD10_AFx_GPIO()                     (CW_GPIOD->AFRH_f.AFR10 = 0)
#define PD10_AFx_UART5TXD()                 (CW_GPIOD->AFRH_f.AFR10 = 1)
#define PD10_AFx_LPTIMCH1()                 (CW_GPIOD->AFRH_f.AFR10 = 2)
#define PD10_AFx_GTIM4CH1()                 (CW_GPIOD->AFRH_f.AFR10 = 3)
#define PD10_AFx_SPI2MISO()                 (CW_GPIOD->AFRH_f.AFR10 = 4)
#define PD10_AFx_GTIM1CH3()                 (CW_GPIOD->AFRH_f.AFR10 = 5)
#define PD10_AFx_ATIMCH3A()                 (CW_GPIOD->AFRH_f.AFR10 = 6)
#define PD11_AFx_GPIO()                     (CW_GPIOD->AFRH_f.AFR11 = 0)
#define PD11_AFx_UART5RXD()                 (CW_GPIOD->AFRH_f.AFR11 = 1)
#define PD11_AFx_LPTIMETR()                 (CW_GPIOD->AFRH_f.AFR11 = 2)
#define PD11_AFx_GTIM4CH2()                 (CW_GPIOD->AFRH_f.AFR11 = 3)
#define PD11_AFx_SPI2MOSI()                 (CW_GPIOD->AFRH_f.AFR11 = 4)
#define PD11_AFx_GTIM1CH4()                 (CW_GPIOD->AFRH_f.AFR11 = 5)
#define PD11_AFx_ATIMBK()                   (CW_GPIOD->AFRH_f.AFR11 = 6)
#define PD12_AFx_GPIO()                     (CW_GPIOD->AFRH_f.AFR12 = 0)
#define PD12_AFx_UART5CTS()                 (CW_GPIOD->AFRH_f.AFR12 = 1)
#define PD12_AFx_UART4RXD()                 (CW_GPIOD->AFRH_f.AFR12 = 2)
#define PD12_AFx_GTIM4CH3()                 (CW_GPIOD->AFRH_f.AFR12 = 3)
#define PD12_AFx_SPI1CS()                   (CW_GPIOD->AFRH_f.AFR12 = 4)
#define PD12_AFx_BTIM3TOGP()                (CW_GPIOD->AFRH_f.AFR12 = 5)
#define PD12_AFx_AUTOTRIMETR()              (CW_GPIOD->AFRH_f.AFR12 = 6)
#define PD13_AFx_GPIO()                     (CW_GPIOD->AFRH_f.AFR13 = 0)
#define PD13_AFx_UART5RTS()                 (CW_GPIOD->AFRH_f.AFR13 = 1)
#define PD13_AFx_UART4TXD()                 (CW_GPIOD->AFRH_f.AFR13 = 2)
#define PD13_AFx_GTIM4CH4()                 (CW_GPIOD->AFRH_f.AFR13 = 3)
#define PD13_AFx_SPI1SCK()                  (CW_GPIOD->AFRH_f.AFR13 = 4)
#define PD13_AFx_BTIM3TOGN()                (CW_GPIOD->AFRH_f.AFR13 = 5)
#define PD14_AFx_GPIO()                     (CW_GPIOD->AFRH_f.AFR14 = 0)
#define PD14_AFx_UART2TXD()                 (CW_GPIOD->AFRH_f.AFR14 = 1)
#define PD14_AFx_HCLKOUT()                  (CW_GPIOD->AFRH_f.AFR14 = 2)
#define PD14_AFx_GTIM2ETR()                 (CW_GPIOD->AFRH_f.AFR14 = 3)
#define PD14_AFx_SPI1MISO()                 (CW_GPIOD->AFRH_f.AFR14 = 4)
#define PD15_AFx_GPIO()                     (CW_GPIOD->AFRH_f.AFR15 = 0)
#define PD15_AFx_UART2RXD()                 (CW_GPIOD->AFRH_f.AFR15 = 1)
#define PD15_AFx_PCLKOUT()                  (CW_GPIOD->AFRH_f.AFR15 = 2)
#define PD15_AFx_BTIMETR()                  (CW_GPIOD->AFRH_f.AFR15 = 3)
#define PD15_AFx_SPI1MOSI()                 (CW_GPIOD->AFRH_f.AFR15 = 4)

#define PE00_AFx_GPIO()                     (CW_GPIOE->AFRL_f.AFR0  = 0)
#define PE00_AFx_I2C2SCL()                  (CW_GPIOE->AFRL_f.AFR0  = 1)
#define PE00_AFx_GTIM4CH2()                 (CW_GPIOE->AFRL_f.AFR0  = 2)
#define PE00_AFx_LPTIMETR()                 (CW_GPIOE->AFRL_f.AFR0  = 3)
#define PE00_AFx_PCLKOUT()                  (CW_GPIOE->AFRL_f.AFR0  = 4)
#define PE00_AFx_GTIM2TOGP()                (CW_GPIOE->AFRL_f.AFR0  = 5)
#define PE00_AFx_GTIM1CH1()                 (CW_GPIOE->AFRL_f.AFR0  = 6)
#define PE00_AFx_GTIM4TOGP()                (CW_GPIOE->AFRL_f.AFR0  = 7)
#define PE01_AFx_GPIO()                     (CW_GPIOE->AFRL_f.AFR1  = 0)
#define PE01_AFx_I2C2SDA()                  (CW_GPIOE->AFRL_f.AFR1  = 1)
#define PE01_AFx_GTIM4CH3()                 (CW_GPIOE->AFRL_f.AFR1  = 2)
#define PE01_AFx_LPTIMOUT()                 (CW_GPIOE->AFRL_f.AFR1  = 3)
#define PE01_AFx_HCLKOUT()                  (CW_GPIOE->AFRL_f.AFR1  = 4)
#define PE01_AFx_GTIM2TOGN()                (CW_GPIOE->AFRL_f.AFR1  = 5)
#define PE01_AFx_GTIM1CH2()                 (CW_GPIOE->AFRL_f.AFR1  = 6)
#define PE01_AFx_GTIM4TOGN()                (CW_GPIOE->AFRL_f.AFR1  = 7)
#define PE02_AFx_GPIO()                     (CW_GPIOE->AFRL_f.AFR2  = 0)
#define PE02_AFx_LPTIMETR()                 (CW_GPIOE->AFRL_f.AFR2  = 1)
#define PE02_AFx_LVDOUT()                   (CW_GPIOE->AFRL_f.AFR2  = 3)
#define PE02_AFx_IROUT()                    (CW_GPIOE->AFRL_f.AFR2  = 4)
#define PE02_AFx_GTIM1ETR()                 (CW_GPIOE->AFRL_f.AFR2  = 5)
#define PE02_AFx_ATIMBK()                   (CW_GPIOE->AFRL_f.AFR2  = 6)
#define PE03_AFx_GPIO()                     (CW_GPIOE->AFRL_f.AFR3  = 0)
#define PE03_AFx_LPTIMCH1()                 (CW_GPIOE->AFRL_f.AFR3  = 1)
#define PE03_AFx_UART5RXD()                 (CW_GPIOE->AFRL_f.AFR3  = 2)
#define PE03_AFx_I2C2SCL()                  (CW_GPIOE->AFRL_f.AFR3  = 3)
#define PE03_AFx_SPI1CS()                   (CW_GPIOE->AFRL_f.AFR3  = 4)
#define PE03_AFx_GTIM1CH4()                 (CW_GPIOE->AFRL_f.AFR3  = 5)
#define PE03_AFx_ATIMCH1B()                 (CW_GPIOE->AFRL_f.AFR3  = 6)
#define PE04_AFx_GPIO()                     (CW_GPIOE->AFRL_f.AFR4  = 0)
#define PE04_AFx_LPTIMCH2()                 (CW_GPIOE->AFRL_f.AFR4  = 1)
#define PE04_AFx_UART5TXD()                 (CW_GPIOE->AFRL_f.AFR4  = 2)
#define PE04_AFx_I2C2SDA()                  (CW_GPIOE->AFRL_f.AFR4  = 3)
#define PE04_AFx_SPI1SCK()                  (CW_GPIOE->AFRL_f.AFR4  = 4)
#define PE04_AFx_GTIM1CH3()                 (CW_GPIOE->AFRL_f.AFR4  = 5)
#define PE04_AFx_ATIMCH2B()                 (CW_GPIOE->AFRL_f.AFR4  = 6)
#define PE05_AFx_GPIO()                     (CW_GPIOE->AFRL_f.AFR5  = 0)
#define PE05_AFx_UART5CTS()                 (CW_GPIOE->AFRL_f.AFR5  = 2)
#define PE05_AFx_UART6RXD()                 (CW_GPIOE->AFRL_f.AFR5  = 3)
#define PE05_AFx_SPI1MISO()                 (CW_GPIOE->AFRL_f.AFR5  = 4)
#define PE05_AFx_GTIM1CH2()                 (CW_GPIOE->AFRL_f.AFR5  = 5)
#define PE05_AFx_ATIMCH3B()                 (CW_GPIOE->AFRL_f.AFR5  = 6)
#define PE06_AFx_GPIO()                     (CW_GPIOE->AFRL_f.AFR6  = 0)
#define PE06_AFx_UART5RTS()                 (CW_GPIOE->AFRL_f.AFR6  = 2)
#define PE06_AFx_UART6TXD()                 (CW_GPIOE->AFRL_f.AFR6  = 3)
#define PE06_AFx_SPI1MOSI()                 (CW_GPIOE->AFRL_f.AFR6  = 4)
#define PE06_AFx_GTIM1CH1()                 (CW_GPIOE->AFRL_f.AFR6  = 5)
#define PE06_AFx_ATIMETR()                  (CW_GPIOE->AFRL_f.AFR6  = 6)
#define PE07_AFx_GPIO()                     (CW_GPIOE->AFRL_f.AFR7  = 0)
#define PE07_AFx_UART2RTS()                 (CW_GPIOE->AFRL_f.AFR7  = 1)
#define PE07_AFx_LPTIMCH1()                 (CW_GPIOE->AFRL_f.AFR7  = 2)
#define PE07_AFx_GTIM1CH4()                 (CW_GPIOE->AFRL_f.AFR7  = 3)
#define PE07_AFx_GTIM4ETR()                 (CW_GPIOE->AFRL_f.AFR7  = 4)
#define PE07_AFx_BTIMETR()                  (CW_GPIOE->AFRL_f.AFR7  = 5)
#define PE07_AFx_ATIMCH2A()                 (CW_GPIOE->AFRL_f.AFR7  = 6)
#define PE08_AFx_GPIO()                     (CW_GPIOE->AFRH_f.AFR8  = 0)
#define PE08_AFx_UART1TXD()                 (CW_GPIOE->AFRH_f.AFR8  = 1)
#define PE08_AFx_LPTIMCH2()                 (CW_GPIOE->AFRH_f.AFR8  = 2)
#define PE08_AFx_GTIM1CH3()                 (CW_GPIOE->AFRH_f.AFR8  = 3)
#define PE08_AFx_SPI1CS()                   (CW_GPIOE->AFRH_f.AFR8  = 4)
#define PE08_AFx_GTIM4CH1()                 (CW_GPIOE->AFRH_f.AFR8  = 5)
#define PE08_AFx_ATIMCH3A()                 (CW_GPIOE->AFRH_f.AFR8  = 6)
#define PE09_AFx_GPIO()                     (CW_GPIOE->AFRH_f.AFR9  = 0)
#define PE09_AFx_UART1RXD()                 (CW_GPIOE->AFRH_f.AFR9  = 1)
#define PE09_AFx_LPTIMOUT()                 (CW_GPIOE->AFRH_f.AFR9  = 2)
#define PE09_AFx_GTIM1ETR()                 (CW_GPIOE->AFRH_f.AFR9  = 3)
#define PE09_AFx_SPI1SCK()                  (CW_GPIOE->AFRH_f.AFR9  = 4)
#define PE09_AFx_GTIM3CH1()                 (CW_GPIOE->AFRH_f.AFR9  = 5)
#define PE09_AFx_ATIMBK()                   (CW_GPIOE->AFRH_f.AFR9  = 6)
#define PE09_AFx_ATIMCH2A()                 (CW_GPIOE->AFRH_f.AFR9  = 7)
#define PE10_AFx_GPIO()                     (CW_GPIOE->AFRH_f.AFR10 = 0)
#define PE10_AFx_UART4TXD()                 (CW_GPIOE->AFRH_f.AFR10 = 1)
#define PE10_AFx_LPTIMETR()                 (CW_GPIOE->AFRH_f.AFR10 = 2)
#define PE10_AFx_GTIM1CH2()                 (CW_GPIOE->AFRH_f.AFR10 = 3)
#define PE10_AFx_SPI1MISO()                 (CW_GPIOE->AFRH_f.AFR10 = 4)
#define PE10_AFx_GTIM3CH2()                 (CW_GPIOE->AFRH_f.AFR10 = 5)
#define PE10_AFx_ATIMETR()                  (CW_GPIOE->AFRH_f.AFR10 = 6)
#define PE11_AFx_GPIO()                     (CW_GPIOE->AFRH_f.AFR11 = 0)
#define PE11_AFx_UART4RXD()                 (CW_GPIOE->AFRH_f.AFR11 = 1)
#define PE11_AFx_UART1RXD()                 (CW_GPIOE->AFRH_f.AFR11 = 2)
#define PE11_AFx_GTIM1CH1()                 (CW_GPIOE->AFRH_f.AFR11 = 3)
#define PE11_AFx_SPI1MOSI()                 (CW_GPIOE->AFRH_f.AFR11 = 4)
#define PE11_AFx_GTIM3CH3()                 (CW_GPIOE->AFRH_f.AFR11 = 5)
#define PE12_AFx_GPIO()                     (CW_GPIOE->AFRH_f.AFR12 = 0)
#define PE12_AFx_UART3TXD()                 (CW_GPIOE->AFRH_f.AFR12 = 1)
#define PE12_AFx_GTIM2CH4()                 (CW_GPIOE->AFRH_f.AFR12 = 3)
#define PE12_AFx_SPI2CS()                   (CW_GPIOE->AFRH_f.AFR12 = 4)
#define PE12_AFx_GTIM3CH4()                 (CW_GPIOE->AFRH_f.AFR12 = 5)
#define PE12_AFx_ATIMCH1B()                 (CW_GPIOE->AFRH_f.AFR12 = 6)
#define PE13_AFx_GPIO()                     (CW_GPIOE->AFRH_f.AFR13 = 0)
#define PE13_AFx_UART3RXD()                 (CW_GPIOE->AFRH_f.AFR13 = 1)
#define PE13_AFx_GTIM2CH3()                 (CW_GPIOE->AFRH_f.AFR13 = 3)
#define PE13_AFx_SPI2SCK()                  (CW_GPIOE->AFRH_f.AFR13 = 4)
#define PE13_AFx_GTIM4CH2()                 (CW_GPIOE->AFRH_f.AFR13 = 5)
#define PE13_AFx_ATIMCH2B()                 (CW_GPIOE->AFRH_f.AFR13 = 6)
#define PE14_AFx_GPIO()                     (CW_GPIOE->AFRH_f.AFR14 = 0)
#define PE14_AFx_UART2TXD()                 (CW_GPIOE->AFRH_f.AFR14 = 1)
#define PE14_AFx_GTIM2CH2()                 (CW_GPIOE->AFRH_f.AFR14 = 3)
#define PE14_AFx_SPI2MISO()                 (CW_GPIOE->AFRH_f.AFR14 = 4)
#define PE14_AFx_GTIM4CH3()                 (CW_GPIOE->AFRH_f.AFR14 = 5)
#define PE14_AFx_ATIMCH3B()                 (CW_GPIOE->AFRH_f.AFR14 = 6)
#define PE15_AFx_GPIO()                     (CW_GPIOE->AFRH_f.AFR15 = 0)
#define PE15_AFx_UART2RXD()                 (CW_GPIOE->AFRH_f.AFR15 = 1)
#define PE15_AFx_GTIM2CH1()                 (CW_GPIOE->AFRH_f.AFR15 = 3)
#define PE15_AFx_SPI2MOSI()                 (CW_GPIOE->AFRH_f.AFR15 = 4)
#define PE15_AFx_GTIM4CH4()                 (CW_GPIOE->AFRH_f.AFR15 = 5)
#define PE15_AFx_ATIMBK()                   (CW_GPIOE->AFRH_f.AFR15 = 6)

