qinikat/CW32-LowPowerBroadcastModule/Libraries/inc/cw32l083_gpio.h
#define PF00_AFx_GPIO()                     (CW_GPIOF->AFRL_f.AFR0  = 0)
#define PF00_AFx_AUTOTRIMETR()              (CW_GPIOF->AFRL_f.AFR0  = 1)
#define PF00_AFx_GTIM4CH2()                 (CW_GPIOF->AFRL_f.AFR0  = 2)
#define PF00_AFx_I2C1SDA()                  (CW_GPIOF->AFRL_f.AFR0  = 3)
#define PF00_AFx_BTIM1TOGP()                (CW_GPIOF->AFRL_f.AFR0  = 4)
#define PF00_AFx_SPI2SCK()                  (CW_GPIOF->AFRL_f.AFR0  = 5)
#define PF00_AFx_GTIM2TOGN()                (CW_GPIOF->AFRL_f.AFR0  = 6)
#define PF00_AFx_GTIM3CH3()                 (CW_GPIOF->AFRL_f.AFR0  = 7)
#define PF01_AFx_GPIO()                     (CW_GPIOF->AFRL_f.AFR1  = 0)
#define PF01_AFx_LSEOUT()                   (CW_GPIOF->AFRL_f.AFR1  = 1)
#define PF01_AFx_GTIM4CH1()                 (CW_GPIOF->AFRL_f.AFR1  = 2)
#define PF01_AFx_I2C1SCL()                  (CW_GPIOF->AFRL_f.AFR1  = 3)
#define PF01_AFx_BTIM1TOGN()                (CW_GPIOF->AFRL_f.AFR1  = 4)
#define PF01_AFx_SPI2CS()                   (CW_GPIOF->AFRL_f.AFR1  = 5)
#define PF01_AFx_GTIM2TOGP()                (CW_GPIOF->AFRL_f.AFR1  = 6)
#define PF01_AFx_GTIM3CH4()                 (CW_GPIOF->AFRL_f.AFR1  = 7)
#define PF02_AFx_GPIO()                     (CW_GPIOF->AFRL_f.AFR2  = 0)
#define PF02_AFx_UART5CTS()                 (CW_GPIOF->AFRL_f.AFR2  = 1)
#define PF02_AFx_LVDOUT()                   (CW_GPIOF->AFRL_f.AFR2  = 3)
#define PF02_AFx_LSIOUT()                   (CW_GPIOF->AFRL_f.AFR2  = 4)
#define PF02_AFx_GTIM3TOGP()                (CW_GPIOF->AFRL_f.AFR2  = 5)
#define PF02_AFx_MCOOUT()                   (CW_GPIOF->AFRL_f.AFR2  = 6)
#define PF04_AFx_GPIO()                     (CW_GPIOF->AFRL_f.AFR4  = 0)
#define PF04_AFx_UART1TXD()                 (CW_GPIOF->AFRL_f.AFR4  = 1)
#define PF04_AFx_GTIM4CH2()                 (CW_GPIOF->AFRL_f.AFR4  = 2)
#define PF04_AFx_UART5RXD()                 (CW_GPIOF->AFRL_f.AFR4  = 4)
#define PF04_AFx_ATIMGATE()                 (CW_GPIOF->AFRL_f.AFR4  = 5)
#define PF05_AFx_GPIO()                     (CW_GPIOF->AFRL_f.AFR5  = 0)
#define PF05_AFx_UART1RXD()                 (CW_GPIOF->AFRL_f.AFR5  = 1)
#define PF05_AFx_BTIMETR()                  (CW_GPIOF->AFRL_f.AFR5  = 2)
#define PF05_AFx_UART5TXD()                 (CW_GPIOF->AFRL_f.AFR5  = 4)
#define PF05_AFx_AUTOTRIMETR()              (CW_GPIOF->AFRL_f.AFR5  = 5)
#define PF06_AFx_GPIO()                     (CW_GPIOF->AFRL_f.AFR6  = 0)
#define PF06_AFx_UART6CTS()                 (CW_GPIOF->AFRL_f.AFR6  = 1)
#define PF06_AFx_I2C1SCL()                  (CW_GPIOF->AFRL_f.AFR6  = 2)
#define PF06_AFx_GTIM4TOGN()                (CW_GPIOF->AFRL_f.AFR6  = 3)
#define PF06_AFx_UART2CTS()                 (CW_GPIOF->AFRL_f.AFR6  = 4)
#define PF06_AFx_I2C2SCL()                  (CW_GPIOF->AFRL_f.AFR6  = 5)
#define PF06_AFx_GTIM3TOGN()                (CW_GPIOF->AFRL_f.AFR6  = 6)
#define PF06_AFx_BTIM3TOGP()                (CW_GPIOF->AFRL_f.AFR6  = 7)
#define PF07_AFx_GPIO()                     (CW_GPIOF->AFRL_f.AFR7  = 0)
#define PF07_AFx_UART6RTS()                 (CW_GPIOF->AFRL_f.AFR7  = 1)
#define PF07_AFx_I2C1SDA()                  (CW_GPIOF->AFRL_f.AFR7  = 2)
#define PF07_AFx_GTIM4TOGP()                (CW_GPIOF->AFRL_f.AFR7  = 3)
#define PF07_AFx_UART2RTS()                 (CW_GPIOF->AFRL_f.AFR7  = 4)
#define PF07_AFx_I2C2SDA()                  (CW_GPIOF->AFRL_f.AFR7  = 5)
#define PF07_AFx_GTIM3TOGP()                (CW_GPIOF->AFRL_f.AFR7  = 6)
#define PF07_AFx_BTIM3TOGN()                (CW_GPIOF->AFRL_f.AFR7  = 7)
#define PF08_AFx_GPIO()                     (CW_GPIOF->AFRH_f.AFR8  = 0)
#define PF08_AFx_UART5RTS()                 (CW_GPIOF->AFRH_f.AFR8  = 1)
#define PF08_AFx_PLLOUT()                   (CW_GPIOF->AFRH_f.AFR8  = 3)
#define PF08_AFx_PCLKOUT()                  (CW_GPIOF->AFRH_f.AFR8  = 4)
#define PF08_AFx_GTIM3TOGN()                (CW_GPIOF->AFRH_f.AFR8  = 5)
#define PF09_AFx_GPIO()                     (CW_GPIOF->AFRH_f.AFR9  = 0)
#define PF09_AFx_UART2TXD()                 (CW_GPIOF->AFRH_f.AFR9  = 1)
#define PF09_AFx_UART3RXD()                 (CW_GPIOF->AFRH_f.AFR9  = 2)
#define PF09_AFx_BTIM3TOGP()                (CW_GPIOF->AFRH_f.AFR9  = 4)
#define PF09_AFx_RTCOUT()                   (CW_GPIOF->AFRH_f.AFR9  = 5)
#define PF09_AFx_GTIM1CH1()                 (CW_GPIOF->AFRH_f.AFR9  = 6)
#define PF09_AFx_HCLKOUT()                  (CW_GPIOF->AFRH_f.AFR9  = 7)
#define PF10_AFx_GPIO()                     (CW_GPIOF->AFRH_f.AFR10 = 0)
#define PF10_AFx_UART2RXD()                 (CW_GPIOF->AFRH_f.AFR10 = 1)
#define PF10_AFx_UART3TXD()                 (CW_GPIOF->AFRH_f.AFR10 = 2)
#define PF10_AFx_BTIM3TOGN()                (CW_GPIOF->AFRH_f.AFR10 = 4)
#define PF10_AFx_HSIOSCOUT()                (CW_GPIOF->AFRH_f.AFR10 = 5)
#define PF10_AFx_GTIM1CH2()                 (CW_GPIOF->AFRH_f.AFR10 = 6)
#define PF10_AFx_MCOOUT()                   (CW_GPIOF->AFRH_f.AFR10 = 7)

//============================================================

#ifdef __cplusplus
}
#endif

#endif
